[{"pk": 1, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Sir Nicholas de Mimsy-Porpington", "school_headmastered": null, "description": "Sir Nicholas de Mimsy-Porpington, known after his death in 1492 as Nearly Headless Nick, was a wizard who attended Hogwarts School of Witchcraft and Wizardry and was Sorted into Gryffindor House. He was a wizard of the royal court as an adult. He was executed by an improper decapitation, after he had a magical mishap with Lady Grieve, in which he tried to straighten her teeth but it backfired and she grew tusks. Since then, he is the resident ghost of Gryffindor Tower at the Hogwarts Castle.\r\n\r\nSir Nicholas met Lady Grieve while strolling in the park on the evening of 30 October, 1492. She was certain he could straighten her crooked teeth, but his attempt to do so backfired, causing her to grow a tusk. Sir Nicholas was immediately taken into custody and sentenced to death as a result of this mistake. Before being locked in a dungeon, his wand was taken from him, thus preventing him from using magic to escape. Throughout the night he cried that he would soon undo the damage done to Lady Grieve. A priest came to Sir Nicholas's cell to comfort him and escort him to the execution site at dawn the following day. He became a \"gibbering wreck\" when the executioner told him to kneel before the block. However, the executioner's axe was blunt, as the grindstone used to sharpen it had been misplaced. Thus, it took forty-five hacks to kill Sir Nicholas, and even then his head was only partially severed.\r\n\r\nSir Nicholas chose to linger as a ghost rather than \"go on\", because, by his own admission, he feared death. He became the resident ghost of Gryffindor Tower at Hogwarts School of Witchcraft and Wizardry. Nearly Headless Nick\", as he was called by the majority of the student body, was always happy to point new Gryffindors in the right direction when late to class.", "shop": null, "hidden": false, "image": "images/nearly-headless-nick.gif", "wand": "", "creature": 1, "name": "Nearly Headless Nick", "house": 3, "school_founded": null, "school_taught": null, "quote": "I was afraid of death. I chose to remain behind. I sometimes wonder whether I oughtn't to have… well, that is neither here nor there… in fact, I am neither here nor there… I know nothing of the secrets of death, Harry, for I chose my feeble imitation of life instead."}}, {"pk": 2, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "The Sorting Hat", "school_headmastered": null, "description": "<p>Professor Godric Gryffindor was a wizard of medieval times and one of the four founders of Hogwarts School of Witchcraft and Wizardry. He was good friends with Salazar Slytherin but opposed him when he later thought that they should not accept Muggle-born students at Hogwarts. It is unknown when he died. Gryffindor's birthplace became known as Godric's Hollow, in his honour. Godric Gryffindor's portrait still remains at Hogwarts. Gryffindor hailed from a moor which is now known as Godric's Hollow, a small West Country village in England. He was described as being \"the best duellist of his time.\"</p>\r\n\r\n<p>Gryffindor is said to have praised courage, determination and strength of heart above all other qualities. Indeed, he selected students for his house based upon their daring and bravery, according to the Sorting Hat. He also was the most in favour of allowing Muggle-borns into the school. The founders, however, were unsure of how they would Sort the students when they were dead. To solve this, Gryffindor took off his hat and all four of them enchanted it so that it could Sort the students long after their deaths. It was, from then on, known as the Sorting Hat.</p>", "shop": null, "hidden": false, "image": "images/gryffindors-sword.gif", "wand": "", "creature": null, "name": "Godric Gryffindor", "house": 3, "school_founded": 1, "school_taught": 1, "quote": "By Gryffindor, the bravest were</b>\r\nPrized far beyond the rest."}}, {"pk": 4, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "Aberforth Dumbledore", "school_headmastered": null, "description": "Ariana Dumbledore was the youngest sister to Albus Dumbledore and Aberforth Dumbledore. When she was 6-years-old, muggle boys attacked Ariana because they wanted to see her perform magic. Traumatized, from then on she could not control her magical abilities. Her father seeked revenge on the muggle boys and was sent to Azkaban, while the rest of the family moved to Godric's Hollow and hid Ariana away. They did this so she would not be sent to St. Mungo's, as her instability threatened the Statute of Secrecy\r\nWhen she was 14-years-old, she caused a magical explosion whilst arguing with her mother and killed her. Eventually, she was accidentally killed by getting in the way of a duel between Aberforth, Albus, and Albus' friend Gellert Grindelwald.", "shop": null, "hidden": false, "image": "images/ariana-dumbledore.jpg", "wand": "", "creature": null, "name": "Ariana Dumbledore", "house": null, "school_founded": null, "school_taught": null, "quote": "It destroyed her, what they did: She was never right again. She wouldn't use magic, but she couldn't get rid of it, it turned inward and drove her mad, it exploded out of her when she couldn't control it, and at times she was strange and dangerous. But mostly she was sweet and scared and harmless."}}, {"pk": 6, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Albus Dumbledore", "school_headmastered": 1, "description": "<p>Albus Dumbledore is considered one of the greatest headmaster of Hogwarts School of Witchcraft and Wizardry and the most powerful wizard of his time. Dumbledore holds the Order of Merlin, First Class, for Grand Sorcery. He was the headmaster while Harry Potter attended school and also a professor while Tom Riddle, who would later become Voldemort, attended school. Dumbledore founded the Order of the Phoenix, a resistance against the reign of the dark wizard Voldemort, and he was the only wizard of which Voldemort was afraid.</p>\r\n\r\n<p>Dumbledore's full name is Albus Percival Wulfric Brian Dumbledore. Rowling chose \"Dumbledore\" because it means \"bumblebee,\" and she liked to imagine Dumbledore humming to himself similar to a bee buzzing around.</p>\r\n\r\n<p>Dumbledore was killed by Severus Snape in 1997 at age 115.</p>", "shop": null, "hidden": false, "image": "images/albus-dumbledore.gif", "wand": "15 inches elder wood with thestral hair", "creature": null, "name": "Albus Dumbledore", "house": 3, "school_founded": null, "school_taught": 1, "quote": "It does not do to dwell on dreams and forget to live. Remember that."}}, {"pk": 7, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Harry Potter", "school_headmastered": null, "description": "<p>Harry Potter is The Boy Who Lived, one of the most famous wizards of his time. In July 1980, Voldemort tried to murder Harry Potter while he was still a baby, afraid of a prophecy that said Potter would be the one to defeat him. His mother Lily Potter sacrificed herself for Harry, which gave Harry an ancient form of protection magic based on love. This protection caused Voldemort's killing curse to backfire onto himself, but left Harry with a lightning-shaped cursed scar on his forehead. This created a connection between Harry and Voldemort, allowing Harry to speak Parseltongue.</p>\r\n\r\n<p>Harry was raised by his aunt Petunia and uncle Vernon Dursley, who resented everything abnormal, including Harry. It wasn't until his 11th birthday that Potter discovered he was a wizard, and began attending Hogwarts School of Witchcraft and Wizardry with the inheritance his parents left behind. Here he met his dearest friends Ron Weasley and Hermione Granger. Harry became one of the youngest seekers for the Gryffindor Quidditch team during his first year. He also became one of the youngest Triwizard Tournament contestants during his fourth year.</p>\r\n\r\n<p>Along with other friends, Ron, Hermione, and Harry went on many adventures thrwarting evil throughout their school career. They stopped Professor Quirrell from bringing back Voldemort with the Philosopher's Stone. They stopped Tom Riddle's revival of the Chamber of Secrets. And finally in their last year at Hogwarts, they defeated Voldemort once and for all.</p>", "shop": null, "hidden": false, "image": "images/harry-potter.gif", "wand": "11 inches holly wood with phoenix feather", "creature": null, "name": "Harry Potter", "house": 3, "school_founded": null, "school_taught": null, "quote": "Every great wizard in history has started out as nothing more than what we are now, students. If they can do it, why not us?"}}, {"pk": 8, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": 1, "magical": false, "school_attended": null, "quote_by": "Argus Filch", "school_headmastered": null, "description": "<p>Argus Filch was a Squib and the caretaker of Hogwarts School of Witchcraft and Wizardry since around 1973. Filch usually wandered around the school corridors with his cat Mrs Norris, trying to catch students breaking the school rules and complaining about Peeves the Poltergeist. In 1992, after Mrs Norris was petrified by Salazar Slytherin's Basilisk, Filch was furious. However, his cat was healed by the end of the year. In 1995, when Dolores Umbridge became High Inquisitor at Hogwarts, Filch gladly supported her. The next year, he was responsible for recognizing Dark objects that were brought into Hogwarts. He helped the students leave the school during the Battle of Hogwarts in 1998. He kept his job of caretaker after the Second Wizarding War. Filch is the only one of the Hogwarts staff to stay at Hogwarts Castle during the summer holidays.</p>", "shop": null, "hidden": false, "image": "images/argus-filch.gif", "wand": "", "creature": null, "name": "Argus Filch", "house": null, "school_founded": null, "school_taught": null, "quote": "A pity they let the old punishments die. Was a time detention would find you hanging by your thumbs in the dungeons. God, I miss the screaming."}}, {"pk": 9, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "Rita Skeeter", "school_headmastered": null, "description": "<p>Ms Rita Skeeter (b. 1951) was a witch journalist who specialized in writing poison-pen stories which tended to be based on false information and misreported interviews while she worked for the Daily Prophet, as well authoring a few tell-all biographies. Albus Dumbledore described her writing as \"enchantingly nasty\" after she wrote an unfavorable article about him. Notable stories Rita covered include the trials of various Death Eaters after the First Wizarding War, the Triwizard Tournament, and, albeit reluctantly, Harry Potter's account of Lord Voldemort's return to power in 1995 for The Quibbler. She also wrote biographies of Armando Dippet, Albus Dumbledore, Severus Snape, and Harry Potter. Rita's writing tended to be sensationalist, and sometimes outright dishonest. Her ability to acquire information was assisted by her status as an unregistered beetle Animagus.</p>", "shop": null, "hidden": false, "image": "images/rita-skeeter.gif", "wand": "", "creature": null, "name": "Rita Skeeter", "house": null, "school_founded": null, "school_taught": null, "quote": "Hello, I'm Rita Skeeter! I write for the Daily Prophet. But, of course, you know that, don't you? It's you we don't know. You're the juicy news. What quirks lurk beneath those rosy cheeks? What mysteries do the muscles mask? Does courage lie beneath those curls? In short, what makes a champion tick? Me, myself and I want to know. Not to mention my ravid readers."}}, {"pk": 10, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": 1, "magical": true, "school_attended": 1, "quote_by": "Albus Dumbledore", "school_headmastered": null, "description": "<p>Professor Rubeus Hagrid (b. 6 December, 1928) was a half-giant wizard, son of Mr. Hagrid and the giantess Fridwulfa, and elder half-brother of the giant Grawp. He attended Hogwarts School of Witchcraft and Wizardry in 1940 and was sorted into Gryffindor house. In Hagrid's third year, he was framed by Tom Riddle for the crime of opening the Chamber of Secrets and using his pet Acromantula to attack several Muggle-born students and eventually kill one of them. Though Hagrid's wand was snapped and he was expelled, he was trained as gamekeeper of Hogwarts and allowed to live on the school grounds at the request of Albus Dumbledore. In 1991, Hagrid was given the task of reintroducing Harry Potter to the wizarding world. In 1993, Hagrid would assume the post of Care of Magical Creatures professor after the retirement of Professor Silvanus Kettleburn.</p>\r\n\r\n<p>As a member of both the original and the re-instated Order of the Phoenix, Hagrid fought in several battles of the First and the Second Wizarding Wars, including the Battle of Hogwarts in 1998. By 2017, he was still living, and presumably still teaching and tending to his gamekeeping duties at Hogwarts.</p>", "shop": null, "hidden": false, "image": "images/rubeus-hagrid.gif", "wand": "16 inches oak (Broken in third year - repaired and kept in a pink umbrella)", "creature": null, "name": "Rubeus Hagrid", "house": 3, "school_founded": null, "school_taught": null, "quote": "I would trust Hagrid with my life."}}, {"pk": 11, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Helena Ravenclaw", "school_headmastered": null, "description": "<p>The Bloody Baron (late 10th century – early 11th century) was a wizard who attended Hogwarts School of Witchcraft and Wizardry in the Founders' time and was Sorted into Slytherin house. After Hogwarts, he fell in love with Helena Ravenclaw, but she did not love him. He was sent by Rowena Ravenclaw to find Helena in Albania, but Helena refused to return with him and so he killed her in a rage. When he realised what he had done, the Baron stabbed himself with the same knife and died. Since then, he is one of the ghosts that haunts Hogwarts School of Witchcraft and Wizardry, and the ghost of Slytherin house. Covered in Helena Ravenclaw's blood to this day, he earned himself the moniker of \"Bloody Baron\".</p>", "shop": null, "hidden": false, "image": "images/bloody-baron.gif", "wand": "", "creature": 1, "name": "The Bloody Baron", "house": 4, "school_founded": null, "school_taught": null, "quote": "When he saw what he had done, he was overcome with remorse. He took the weapon that had claimed my life, and used it to kill himself. All these centuries later, he wears his chains as an act of penitence… as he should."}}, {"pk": 12, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "Ron Weasley", "school_headmastered": null, "description": "<p>Professor Salazar Slytherin was a pure-blood wizard of medieval times. He was a Parselmouth (a wizard with the rare ability to speak with snakes) and skilled at Legilimency. He was one of the four founders of Hogwarts School of Witchcraft and Wizardry and the former best friend of Godric Gryffindor, a fellow founder.</p>\r\n\r\n<p>Like Rowena Ravenclaw and Godric Gryffindor, Salazar Slytherin appears to have carefully selected members of his own House. According to Albus Dumbledore, the qualities which Slytherin prized in his \"handpicked students\" included resourcefulness, cleverness, determination, and a certain disregard for the rules, along with the ability to speak Parseltongue. He also selected his students according to cunning, ambition, and blood purity. His House within Hogwarts is symbolised by a serpent, with House colours of green and silver.</p>\r\n\r\n<p>After founding Hogwarts and co-existing for years, a rift eventually began to grow between Slytherin and the other founders. Slytherin despised taking students from Muggle families, seeing them as untrustworthy, and tried to persuade the other founders to only take students from pure-blood families. However, the other founders didn't agree with Slytherin, particularly Gryffindor. Eventually, Slytherin and Gryffindor had a huge argument over the subject, according to the Sorting Hat it is possible that they dueled, or that a civil war of sorts broke out between the houses. Slytherin chose to leave the school eventually, but he had left the Chamber of Secrets and his Basilisk behind.[2] It is unknown when he died.</p>", "shop": null, "hidden": false, "image": "images/salazar-slytherin.jpg", "wand": "", "creature": null, "name": "Salazar Slytherin", "house": 4, "school_founded": 1, "school_taught": 1, "quote": "I always knew Salazar Slytherin was a twisted old loony, but I never knew he started all this pure-blood stuff."}}, {"pk": 13, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Draco Malfoy", "school_headmastered": null, "description": "<p>Draco Lucius Malfoy was a pure-blood wizard and the only son of Lucius and Narcissa Malfoy. The son of a Death Eater, Draco was raised to believe strongly in the importance of blood purity. He attended Hogwarts School of Witchcraft and Wizardry from 1991 to 1998 and was sorted into Slytherin house. During his years at Hogwarts, he became friends with Vincent Crabbe, Gregory Goyle, Pansy Parkinson, and other fellow Slytherins, while he quickly developed a rivalry with Harry Potter.</p>\r\n\r\n<p>He was made a prefect for his house and was a member of the Inquisitorial Squad during his fifth year, at the end of which his father was imprisoned in Azkaban following the Battle of the Department of Mysteries. Lord Voldemort charged Draco with making up for Lucius's failure, and he became a Death Eater at age sixteen, but was quickly disillusioned with the lifestyle. Draco was unable to complete his task — murdering Albus Dumbledore, which was taken over by Severus Snape — and only performed his other duties fearfully and reluctantly. He and his family defected hours before the end of the Second Wizarding War in order to avoid imprisonment in Azkaban following Voldemort's defeat.</p>\r\n\r\n<p>The Malfoys were very proud of their pure-blood and social status; until 1996, they were able to maintain a respectable public image while being allied with Lord Voldemort. Lucius was a Death Eater who avoided imprisonment in Azkaban following the First Wizarding War by claiming that he had been under the Imperius Curse, while Narcissa merely agreed with the ideology of pure-blood supremacy. The Malfoys spoiled their son, giving him the best of everything as far as material possessions go. The only hand-me-down thing Draco ever received was the old family prejudice against Muggles, Muggle-borns, half-breeds, and blood traitors; in short, prejudice against anyone who was not a pure-blood witch or wizard, or anyone who supports these types of people. </p>", "shop": null, "hidden": false, "image": "images/draco-malfoy.gif", "wand": "10 inches hawthorn wood with unicorn hair", "creature": null, "name": "Draco Malfoy", "house": 4, "school_founded": null, "school_taught": null, "quote": "I really don't think they should let the other sort in, do you? They're just not the same, they've never been brought up to know our ways. Some of them have never even heard of Hogwarts until they get the letter, I imagine. I think they should keep it in the old wizarding families."}}, {"pk": 14, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Harry Potter", "school_headmastered": 1, "description": "<p>Professor Severus Snape was a half-blood wizard who was the son of the witch Eileen Snape and Muggle Tobias Snape. During his lifetime, Severus Snape was Potions Master, Defence Against the Dark Arts professor, and Headmaster of Hogwarts School of Witchcraft and Wizardry (which he attended as a student from 1971 until 1978). He was also member of the Order of the Phoenix and played a very important role in both of the Wizarding Wars against Lord Voldemort.</p>\r\n\r\n<p>Despite Severus Snape's wizarding heritage, he was raised in the Muggle dwelling of Spinner's End, which was in close proximity to the home of the Evans family. He met Lily and Petunia Evans when he was nine, and fell deeply in love with Lily, becoming a close friend of hers. In 1971 he began his first term at Hogwarts School of Witchcraft and Wizardry where he was sorted into Slytherin. This put him in the same year as his true love, Lily Evans. Severus became the immediate enemy of James Potter and Sirius Black and was a frequent victim of their bullying. Snape developed a passion for the Dark Arts at a young age, and had followed the pure-blood supremacists in Slytherin House, despite his own marred pedigree and his love for Lily, a Muggle-born. This put his friendship with Lily under great strain. After leaving school he joined the Death Eaters along with a large group of his fellow Slytherins.</p>\r\n\r\n<p>Shortly before Lily Evans was killed by Lord Voldemort, Snape changed sides and became a member of the Order of the Phoenix and double agent during the Second Wizarding War. With tremendous difficulty, Snape was able to prevent Lord Voldemort from learning the truth about his loyalties. Despite the opinions of most others, Albus Dumbledore trusted Snape for reasons that were kept between them both until their deaths. Upon his death, it was revealed that his deep, strong love for Lily Evans caused him to redeem himself, joining Dumbledore's cause at the prospect of her protection from Lord Voldemort.</p>\r\n\r\n<p>The relationship between Dumbledore and Snape would be one of an unusually strong loyalty, so much so that Snape agreed to kill Dumbledore upon Dumbledore's own request. Before Dumbledore's death, Snape promised to protect the students of Hogwarts from the Death Eaters, who would inevitably take control of the Ministry of Magic, as well as the school. Snape later participated in the Battle of Hogwarts, but was killed by Lord Voldemort who mistakenly believed that Snape was the master of the Elder Wand, an immensely strong and powerful wand that Voldemort deeply desired, when in reality, Draco Malfoy was, unknowingly, the master of the Elder Wand because he disarmed Dumbledore.</p>\r\n\r\n<p>After his death, Harry Potter ensured that Severus Snape's portrait remained at Hogwarts, honouring him as a hero, despite their significant personal differences. In addition Harry later named his second son Albus Severus Potter after him.</p>", "shop": null, "hidden": false, "image": "images/severus-snape.gif", "wand": "", "creature": null, "name": "Severus Snape", "house": 4, "school_founded": null, "school_taught": 1, "quote": "...he was probably the bravest man I ever knew."}}, {"pk": 15, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Ron Weasley", "school_headmastered": null, "description": "<p>Hermione Granger was the only daughter of Muggle Mr and Mrs Granger, both dentists in London. At age eleven, Hermione learned that she was a witch and had been accepted into Hogwarts School of Witchcraft and Wizardry. She began attending the school on 1 September, 1991 where she was subsequently sorted into Gryffindor House. She possessed a brilliant academic mind and proved to be a gifted student. She was very studious and bookish. Along with Harry Potter and a few others, she was relatively little intimidated by Lord Voldemort's name, calling him by his name, instead of You-Know-Who or He-Who-Must-Not-Be-Named.</p>\r\n\r\n<p>Hermione first met Harry Potter and Ron Weasley aboard the Hogwarts Express. Both boys found Hermione unfriendly and a know-it-all. Later her eagerness to please her professors and her constantly correct answers reinforced their initial impression. However, in spite of the cool relationship between the three, Hermione stepped in to take the blame from Ron and Harry after they had saved her from a troll on Hallowe'en. Harry and Ron were surprised but grateful, and the three quickly became friends. In her second year, Hermione fell victim to a basilisk unleashed upon Hogwarts following the opening of the Chamber of Secrets but was returned from her petrification under the care of Madam Pomfrey with the assistance of Professor Sprout's Mandrake Restorative Draught. The following year, Hermione was granted permission to use, and was sent, a Time-Turner from the Ministry of Magic to facilitate her volition to study far more subjects than was possible without time travel. Later in the year, she and Harry would use the Time-Turner to rescue Sirius Black from the Dementor's Kiss as well as Buckbeak the hippogriff from execution. During her fourth year at Hogwarts, Hermione became an advocate for the better treatment of house-elves, forming the association S.P.E.W. In her fifth year, she was the driving force behind the creation of Dumbledore's Army. Later in her fifth year she fought in the Battle of the Department of Mysteries. In her sixth year she fought in the Battle of the Astronomy Tower and, at the beginning of what would be her seventh year, the Battle of the Seven Potters in 1997. Hermione, as well as Ron — with whom she had become romantically involved — decided not to return to Hogwarts for their final year of studies and instead chose to accompany Harry on his quest to find and destroy Lord Voldemort's Horcruxes. She then fought in, and survived, the Battle of Hogwarts.</p>\r\n\r\n<p>Following the Second Wizarding War, Hermione went back to Hogwarts to complete her education at Hogwarts. Later she found employment with the Ministry of Magic, furthering the cause for the better treatment of house-elves, before being promoted to the Department of Magical Law Enforcement. She eventually married Ron Weasley, and together they had two children: a daughter, Rose, and a son, Hugo. Hermione became the godmother of Harry and Ginny Potter's eldest son James.</p>", "shop": null, "hidden": false, "image": "images/hermione-granger.gif", "wand": "vine wood with dragon heartstring", "creature": null, "name": "Hermione Granger", "house": 3, "school_founded": null, "school_taught": null, "quote": "Because that's what Hermione does. When in doubt, go to the library."}}, {"pk": 16, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Ron Weasley", "school_headmastered": null, "description": "<p>Ronald Bilius \"Ron\" Weasley was a pure-blood wizard, the sixth son of Arthur Weasley and Molly Weasley. He was also the younger brother of Bill, Charlie, Percy, Fred and George, and the elder brother of Ginny. Ron and his brothers and sister lived in The Burrow where Harry and Hermione stayed quite often. Ron began attending Hogwarts School of Witchcraft and Wizardry in 1991 and was sorted into Gryffindor house. He soon became best friends with fellow student Harry Potter and later Hermione Granger.</p>\r\n\r\n<p>Together, they faced many challenges during their adolescence, including keeping the Philosopher's Stone from Professor Quirinus Quirrell, saving Ron's sister from the Chamber of Secrets, forming Dumbledore's Army, and fighting in numerous battles of the Second Wizarding War, including the Battle of the Department of Mysteries, the Battle of the Astronomy Tower, Battle of the Seven Potters and the Battle of Hogwarts. Ron also became a Gryffindor prefect and a Keeper on the Gryffindor Quidditch team during his fifth year at Hogwarts. He skipped his last year of school in order to accompany Harry and Hermione on a quest to destroy the Horcruxes of Lord Voldemort and fought in the Battle of Hogwarts in 1998, in which he lost his brother, Fred, a loss which devastated him and his family.</p>\r\n\r\n<p>After the war, Ron, along with Harry Potter and Neville Longbottom, joined the Aurors at the invitation of Minister for Magic Kingsley Shacklebolt, in order to track down Death Eaters who escaped capture. Eventually, he went to work at Weasleys' Wizard Wheezes with his brother George. He and Hermione eventually married and had two children: a daughter named Rose and a son named Hugo Weasley. Ron was also the godfather to James Sirius Potter, his sister Ginny Weasley and Harry Potter's eldest child.</p>", "shop": null, "hidden": false, "image": "images/ron-weasley.gif", "wand": "12 inches ash wood with unicorn tail hair", "creature": null, "name": "Ron Weasley", "house": 3, "school_founded": null, "school_taught": null, "quote": "Sunshine, daisies, butter mellow,<br/>\r\nTurn this stupid, fat rat yellow."}}, {"pk": 17, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 20, "quote_by": "Rita Skeeter", "school_headmastered": null, "description": "<p>Gellert Grindelwald was considered one of the most powerful Dark Wizards of all time, second only to Tom Marvolo Riddle, who later became known as Lord Voldemort. He was schooled at Durmstrang Institute until his expulsion. Later he fostered a friendship with Albus Dumbledore while living in Godric's Hollow for a summer with his great-aunt, Bathilda Bagshot. The two made plans to find the Deathly Hallows and wield their new-found power as Masters of Death, leading a Wizarding revolution with the aim of ending the International Statute of Secrecy and creating a benevolent global order led by wise and powerful witches and wizards. Their partnership fell apart after the two were involved in a three-way duel with Aberforth Dumbledore that resulted in Ariana Dumbledore's death.</p>\r\n\r\n<p>Grindelwald left Britain and soon stole the Elder Wand, proceeding alone with the revolution he and Dumbledore had planned. He established a power base in continental Europe at the fortress Nurmengard. Grindelwald was a complex figure, highly idealistic but marred by sociopathic tendencies and his links with the Dark Arts, a revolutionary operating outside the law. He was not a wanton killer or torturer, but he and his followers (in a single-minded and unpopular quest; one's allies must often be unsavory characters) committed numerous crimes, including several known murders. In 1945, at the height of his power, Dumbledore confronted and defeated him in a legendary duel. Grindelwald was subsequently imprisoned in his own fortress for decades, and was slain there by Voldemort in 1998 when he refused to give up information on the Elder Wand.</p>", "shop": null, "hidden": false, "image": "images/gellert-grindelwald.gif", "wand": "15 inches elder wood with thestral hair", "creature": null, "name": "Gellert Grindelwald", "house": null, "school_founded": null, "school_taught": null, "quote": "Educated at Durmstrang, a school famous even then for its unfortunate tolerance of the Dark Arts, Grindelwald showed himself quite as precociously brilliant as Dumbledore. Rather than channel his abilities into the attainment of awards and prizes, however, Gellert Grindelwald devoted himself to other pursuits. At sixteen years old, even Durmstrang felt it could no longer turn a blind eye to the twisted experiments of Gellert Grindelwald and he was expelled."}}, {"pk": 18, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "Fat Friar", "school_headmastered": null, "description": "Hufflepuff house ghost", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Fat Friar", "house": null, "school_founded": null, "school_taught": null, "quote": "Hope to see you in Hufflepuff! My old house, you know"}}, {"pk": 19, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "Helga Hufflepuff", "school_headmastered": null, "description": "Founder of the Hufflepuff house of hogwarts", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "unknown", "creature": null, "name": "Helga Hufflepuff", "house": 6, "school_founded": 1, "school_taught": 1, "quote": "I'll teach the lot and treat them just the same."}}, {"pk": 20, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Beedle the Bard", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 21, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Antioch Peverell", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 22, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Ignotus Peverell", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 23, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Cadmus Peverell", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 24, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Voldemort", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 25, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "James Potter", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 26, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Lily Evans", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 27, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Wendelin the Weird", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 28, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Ginny Weasley", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 29, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 20, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Viktor Krum", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 30, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": 19, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Fleur Delacour", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 31, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Cedric Diggory", "house": 6, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 32, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Barty Crouch Jr.", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 33, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Sybill Trelawney", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 34, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Neville Longbottom", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 35, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": 29, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Aberforth Dumbledore", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 36, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Alastor Moody", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 37, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Kingsley Shacklebolt", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 38, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Alice Longbottom", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 39, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Frank Longbottom", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 40, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Arthur Weasley", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 41, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Molly Weasley", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 42, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Sirius Black", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 43, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Remus Lupin", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 44, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Cornelius Fudge", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 45, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Luna Lovegood", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 46, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "Muriel", "school_headmastered": null, "description": "Professor Bathilda Bagshot (d. 1997) was a magical historian and the author of A History of Magic and approximately ten other books. A History of Magic is used in the Hogwarts School of Witchcraft and Wizardry class of the same name, taught by Professor Binns. She lived in Godric's Hollow, and was murdered around December, 1997, after which her corpse was animated by Lord Voldemort to contain his snake Nagini.\r\n\r\nBathilda was also the great-aunt of Gellert Grindelwald, the infamous dark wizard who was defeated by Albus Dumbledore. ", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Bathilda Bagshot", "house": null, "school_founded": null, "school_taught": null, "quote": "A most gifted magical historian and an old friend of Albus's."}}, {"pk": 47, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Gilderoy Lockhart", "school_headmastered": null, "description": "<p>Professor Gilderoy Lockhart, Order of Merlin, Third Class, was a half-blood wizard, a Ravenclaw student at Hogwarts School of Witchcraft and Wizardry, and later a famous wizarding celebrity who authored many books on dark creatures and his encounters with them. Prior to his tenure as Professor of Defence Against the Dark Arts at Hogwarts School of Witchcraft and Wizardry during the 1992–1993 school year, he received many prestigious awards, such as Order of Merlin, Third Class; Honorary Member of the Dark Force Defence League; and five-time winner of Witch Weekly's Most Charming Smile Award. He invented an Occamy egg yolk shampoo, which was too dangerous and expensive for open market; it subsequently became his dream to market these products. His favorite color is lilac.</p>\r\n\r\n<p>He never actually did any of the heroic acts he claimed he had done, but instead used his considerable talent in Memory Charms to force the actual people who had done them into forgetting what they did.</p>", "shop": null, "hidden": false, "image": "images/gilderoy.gif", "wand": "cherry wood and dragon heartstring", "creature": null, "name": "Gilderoy Lockhart", "house": 18, "school_founded": null, "school_taught": 1, "quote": "Celebrity is as celebrity does."}}, {"pk": 48, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "Helena Ravenclaw", "school_headmastered": null, "description": "Also known as Helena Ravenclaw, the Grey Lady was a witch and Rowena Ravenclaw's daughter. She attended Hogwarts School of Witchcraft and Wizardry and was Sorted into Ravenclaw house. At some point, she stole her mother's diadem and ran away to Albania. Rowena became fatally ill, and hoping to see her daughter one last time, sent the Bloody Baron, a man who harboured an unrequited love for Helena, to find her. The Baron killed Helena when she refused to return with him, before killing himself out of regret for what he had done. She and the Baron eventually returned as ghosts to Hogwarts Castle, where Helena became and continues to be the Ghost of Ravenclaw House.", "shop": null, "hidden": false, "image": "images/grey-lady.gif", "wand": "", "creature": 1, "name": "The Grey Lady", "house": 18, "school_founded": null, "school_taught": null, "quote": "I stole the diadem. I sought to make myself cleverer, more important than my mother. I ran away with it. My mother, they say, never admitted that the diadem was gone, but pretended that she had it still. She concealed her loss, my dreadful betrayal, even from the other founders of Hogwarts."}}, {"pk": 49, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "Rowena Ravenclaw", "school_headmastered": null, "description": "Professor Rowena Ravenclaw (fl. c. 993 – 1000) was a Scottish witch, who lived in the early Middle Ages. Noted for her intelligence and creativity and regarded as one of the greatest witches of the age, Ravenclaw was one of the four founders of Hogwarts School of Witchcraft and Wizardry along with Godric Gryffindor, Helga Hufflepuff and Salazar Slytherin, as well as the namesake of the Ravenclaw House. Ravenclaw was \"beautiful yet slightly intimidating.\"\r\n\r\nRavenclaw died sometime into the eleventh century, after she fell fatally ill. Legend had it that a broken heart is the cause — because her daughter, Helena, had run away with her diadem", "shop": null, "hidden": false, "image": "images/rowena-ravenclaw_1.jpg", "wand": "", "creature": null, "name": "Rowena Ravenclaw", "house": 18, "school_founded": 1, "school_taught": 1, "quote": "Wit beyond measure is man's greatest treasure."}}, {"pk": 50, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Matilda Filch", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 51, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "William Filch", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 52, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "asdf", "school_headmastered": null, "description": "asdfasdf", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Hadrian Whittle (possibly)", "house": null, "school_founded": null, "school_taught": null, "quote": "asdf"}}, {"pk": 53, "model": "marauder.character", "fields": {"sex": "NB", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "asdf", "school_headmastered": null, "description": "asdf", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Unknown", "house": null, "school_founded": null, "school_taught": null, "quote": "asdf"}}, {"pk": 54, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "asdf", "school_headmastered": null, "description": "asdf", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Beatrix Bloxam", "house": null, "school_founded": null, "school_taught": null, "quote": "asdf"}}, {"pk": 55, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "asdf", "school_headmastered": null, "description": "asdf", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Libatius Borage", "house": null, "school_founded": null, "school_taught": null, "quote": "asdf"}}, {"pk": 56, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": 5, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Mr. Borgin", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 57, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": 5, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Caractacus Burke", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 58, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": 13, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "George Weasley", "house": 3, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 59, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": 1, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": 13, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Fred Weasley", "house": 3, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 60, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": 14, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Garrick Ollivander", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 61, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": 19, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Olympe Maxime ", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 62, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Nerida Vulchanova", "house": null, "school_founded": 20, "school_taught": null, "quote": "N/A"}}, {"pk": 63, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": 20, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Harfang Munter", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 64, "model": "marauder.character", "fields": {"sex": "M", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": 20, "description": "N/A", "shop": null, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Igor Karkaroff", "house": null, "school_founded": null, "school_taught": 20, "quote": "N/A"}}, {"pk": 65, "model": "marauder.character", "fields": {"sex": "F", "school_staffed": null, "magical": true, "school_attended": null, "quote_by": "N/A", "school_headmastered": null, "description": "N/A", "shop": 21, "hidden": true, "image": "images/empty.jpg", "wand": "", "creature": null, "name": "Potage", "house": null, "school_founded": null, "school_taught": null, "quote": "N/A"}}, {"pk": 1, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Ghosts", "rating": 0, "name": "Ghost", "classification": "Spirit", "image": "images/bloody-baron_1.gif", "description": "<p>A ghost is the disembodied spirit of a once-living wizard or witch. Only magical beings can become ghosts. Many ghosts take up residence within Hogwarts Castle. These fleshless spirits were either afraid of death or have some extraordinarily strong connection to the locations they haunt.</p>\r\n\r\n<p>In their paranormal state, ghosts are unable to have much physical influence. They are visible, and appear as a greyish-silver apparition of their former (living) selves. They pass through solid objects without damaging themselves or the material, but create disturbances in water, fire and air. The temperature drops in the immediate vicinity of a ghost. Their appearance can also turn flames blue.</p>\r\n\r\n<p>In passing through an object, they may impart a sensation of icy coldness. However, they are apparently moved by gusts of wind, as demonstrated when a petrified Nearly Headless Nick was wafted to the Hospital Wing by a large fan, although this may have been possible due to his petrified state. Ghosts are either capable of, or pretend to be capable of, almost being able to taste rotten food. </p>"}}, {"pk": 2, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Werewolves", "rating": 5, "name": "Werewolf", "classification": "Beast", "image": "images/werewolf.gif", "description": "<p>A werewolf is a human being who, upon the complete rising of the full moon, becomes a fearsome and deadly near-wolf. Werewolves can be easily distinguished from regular wolves by their shorter snout, more human-like eyes, the tufted tail, and their mindless hunting of humans whilst in wolf form.</p>\r\n\r\n<p>At all other times, they appear as normal humans, although they will age prematurely, and will gain a pallor as the moon approaches and then wanes. This condition is caused by infection with lycanthropy, also known as werewolfry. A werewolf cannot chose whether or not to transform and will no longer remember who they are and would kill even their best friend given the opportunity once transformed.</p>\r\n\r\n<p>Despite this, they are able to recall everything they have experienced throughout their transformation upon reverting to their human form. A mixture of powdered silver and dittany applied to a fresh bite will seal the wound and allow the victim to live on as a werewolf, although tragic tales are told of witches and wizards begging for death rather than becoming werewolves. The Wolfsbane Potion, invented by Damocles, allows the werewolf to keep their human mind during transformation.</p>"}}, {"pk": 3, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Thestrals", "rating": 4, "name": "Thestral", "classification": "Beast", "image": "images/thestral.gif", "description": "<p>A Thestral is a breed of winged horses with a skeletal body, face with reptilian features, and wide, leathery wings that resemble a bat's.</p>\r\n\r\n<p>They are very rare, and are considered dangerous by the Ministry of Magic. Thestrals are, undeservedly, known as omens of misfortune and aggression by many wizards because they are visible only to those who have witnessed death at least once (and fully accepted the concept) or due to their somewhat grim, gaunt and ghostly appearance.</p>\r\n\r\n<p>Thestrals can be domesticated and mounted, so they are used as an alternative to brooms, Apparition and other methods of transportation. Once trained, they are very diligent and will quickly carry their owners wherever they wish to go. However, travel by Thestral is technically illegal, as it is a breach of the International Statute of Wizarding Secrecy.</p>\r\n\r\n<p>Due to their classification as XXXX, only experienced wizards should try to handle Thestrals. Breeding as well as owning these beasts may be discouraged or even illegal without Ministry consent; in fact, wizards that live in areas not protected against Muggles are forced by law to perform Disillusionment Charms on their Thestrals regularly.</p>"}}, {"pk": 4, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Dementors", "rating": 0, "name": "Dementor", "classification": "NB", "image": "images/dementor.gif", "description": "<p> A Dementor is a non-being and Dark creature, considered one of the foulest to inhabit the world. Dementors feed off human happiness, and thus cause depression and despair to anyone near them. They can also consume a person's soul, leaving their victims in a permanent vegetative state, and thus are often referred to as \"soul-sucking fiends\" and are known to leave a person as an 'empty-shell'.</p> \r\n\r\n<p> The Ministry of Magic employed Dementors as the guards of Azkaban prison, until mid-1996, when Lord Voldemort was sighted in the Ministry, and their defection to his side was realised. The Dementors supposedly led the Death Eaters and Voldemort into the Ministry of Magic. After the end of the Second Wizarding War in 1998, the Ministry was reformed, and Minister for Magic Kingsley Shacklebolt ensured that they were not used by the government again.</p> \r\n\r\n<p> There are certain defences one can use against Dementors, specifically the Patronus Charm. Dementors hold no true loyalty, except to whomever can provide them with the most people to feed off. They cannot be destroyed, though their numbers can be limited if the conditions in which they multiply are reduced, implying that they do die off eventually.</p> "}}, {"pk": 5, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Phoenixes", "rating": 4, "name": "Phoenix", "classification": "Beast", "image": "images/phoenix.gif", "description": "The phoenix is a large swan-sized scarlet bird with red and gold plumage, along with a golden beak and talons, black eyes, and a tail as long as a peacock's. Its scarlet feathers glow faintly in darkness, while its golden tail feathers are hot to the touch. Phoenixes are known for nesting on mountain peaks. They are gentle herbivores and are not known for fighting. As phoenixes approach their Burning Day they resemble a half-plucked turkey. Also, their eyes become dull, their feathers start to fall out, and it begins to make gagging noises. Then the bird suddenly bursts into flames only to rise from the ashes shortly after. In a number of days, they grow back to full size. Thanks to this ability, phoenixes live to an immense age."}}, {"pk": 6, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Boggarts", "rating": 0, "name": "Boggart", "classification": "NB", "image": "images/boggart.jpg", "description": "A boggart is an amortal shape-shifting non-being that takes on the form of the viewer's worst fear. When facing a boggart, it is best to have someone else along, to try to confuse it, since facing more than one person at once would make it indecisive as to what form it must take, usually a mixed-up amalgam of the victims' fears. Because of their shape-shifting ability, no one knows what a boggart looks like when it is alone, as it instantly changes into your worst fears when you first see it."}}, {"pk": 7, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Ashwinders", "rating": 3, "name": "Ashwinder", "classification": "Beast", "image": "images/AshwinderTrophy.png", "description": "Ashwinders are thin, pale gray serpents that are born from magical fires. Right after birth, they leave a trail of ash behind as they slither to a corner to lay their eggs. They will then die after one hour. "}}, {"pk": 8, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Occamies", "rating": 4, "name": "Occamy", "classification": "Beast", "image": "images/250px-Occamy.png", "description": "An occamy is a feathered creature with a serpent's body. It stands on two legs and can grow to be up to 15 feet tall. They are aggressive when approached, and are especially protective of their eggs, which are made of the purest and softest silver on Earth."}}, {"pk": 9, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Murtlaps", "rating": 3, "name": "Murtlap", "classification": "Beast", "image": "images/180px-Murtlap_tentacle.png", "description": "Murtlaps live in the sea and live on mostly crustaceans, but are not averse to making a meal out of a human foot if need be. Each one has a growth on its back that some wizards use to improve their resistance to jinxes. "}}, {"pk": 10, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Goblins", "rating": 1, "name": "Goblin", "classification": "Being", "image": "images/goblin.jpg", "description": "<p>Goblins are a highly intelligent race of small hominids with long fingers and feet that coexist with the wizard world.  Their diet consists of meat, roots and fungi. Goblins converse in a language known as Gobbledegook, and are adept metalsmiths notable for their silverwork; they even mint coins for wizarding currency. Due to their skills with money and finances, they control the wizarding economy to a large extent and run Gringotts Wizarding Bank.</p>\r\n\r\n<p>Goblins have their own type of magic and can do magic without a wand. They are represented by the Goblin Liaison Office of the Department for the Regulation and Control of Magical Creatures in the Ministry of Magic. Goblins are considered to be inferior by many wizards, who foolishly believe that the goblins are comfortable with that arrangement.</p>"}}, {"pk": 11, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Elves", "rating": 0, "name": "House Elf", "classification": "Being", "image": "images/houseElf.gif", "description": "A house-elf (sometimes also referred to as just elves) is a magical creature which is immensely devoted and loyal to the one designated as their master. They serve wizards and witches and are usually found under the employment of old wizarding families taking residence in elaborate establishments, like mansions, and must do everything that their masters command unless they are freed. A house-elf can only be freed when their master presents them with clothes.\r\n"}}, {"pk": 12, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Hippogriffs", "rating": 2, "name": "Hippogriff", "classification": "Beast", "image": "images/Hippogriff.gif", "description": "A Hippogriff is a magical creature that has the front legs, wings, and head of a giant eagle and the body, hind legs and tail of a horse. It is very similar to another mythical creature, the Griffin, with the horse rear replacing the lionrear. Hippogriffs have cruel, steel-coloured beaks and large, brilliantly orange eyes. The talons on their front legs are half a foot long and appear deadly.\r\n"}}, {"pk": 13, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Cenaurs", "rating": 3, "name": "Centaur", "classification": "Being", "image": "images/Centaurs.JPG", "description": "A Centaur is a magical creature whose head, torso and arms appear to be human and are joined to a horse's body.\r\n\r\nThey are, however, their own species, and are not any kind of half-breed.\r\n\r\nDespite possessing 'human intelligence', centaurs are classified as Beasts by the Ministry of Magic, at their own request, as they were unhappy at having to share Being status with hags and vampires."}}, {"pk": 14, "model": "marauder.creature", "fields": {"hidden": false, "plural": "Flobberworms", "rating": 1, "name": "Flobberworm", "classification": "Beast", "image": "images/250px-Flubberwurm.png", "description": "Flobberworms are ten-inch worms that eat vegetation and secrete mucus from both ends of their symmetrical bodies. They are toothless and pose little to no danger. It is one of the only living creatures that the Summoning Charm will work on. "}}, {"pk": 1, "model": "marauder.spell", "fields": {"kind": "Defensive", "incantation": "Expecto Patronum", "image": "images/expectopatronum.gif", "creator": "Ancient Wizard", "alias": "Patronus Charm", "notable_uses": "Harry Potter to repel a huge number of dementors from his past self and Sirius Black, teaches this to the members of Dumbledore's Army; Severus Snape uses his to guide Harry and Ron to the sword of Gryffindor; Various members of the Order of the Phoenix to send messages.\r\n", "creature": 4, "unforgivable": false, "effect": "Conjures a silver guardian spirit made of pure positive energy used to repel dark creatures such as Dementors and Lethifolds and can be either corporeal or not. In a weaker form, a Patronus takes the form of smoke or vapor which can halt dark creatures but is not nearly strong enough to repel them. In its stronger form, a Patronus takes the form of some creature (corporeal form) that relates to the casters' personality and is by far more powerful than the non-corporeal form and able to repel dark creatures in large groups.\r\n\r\nThis is a very powerful spell that even many qualified witches and wizards cannot conjure. It requires the caster focus on the happiest memory that they can think of which often translates into the strength of the spell itself. Dark wizards and witches are typically unable to cast this spell either due to their already existing affinity for dark creatures and that there is a chance that the spell may backfire on them. Harry Potter was able to learn this from Remus Lupin during his third year to repel dementors.\r\n", "difficulty": "Extremely Difficult"}}, {"pk": 2, "model": "marauder.spell", "fields": {"kind": "Charm", "incantation": "Riddikulus", "image": "images/Boggart_banashing_spell.gif", "creator": "Unknown", "alias": "Boggart-Banishing Spell", "notable_uses": "Remus Lupin teaches this to his third year class. \r\nHarry Potter used this during the Triwizard Tournament, during the maze task when confronted with a Boggart in the shape of a Dementor. At first he thought it was a real demontor, but when the Patronus Charm failed, he reasoned it must be a boggart.\r\n", "creature": 6, "unforgivable": false, "effect": "Causes a boggart to assume a form that is hilarious to the caster, which the caster must imagine while casting.\r\n", "difficulty": "Moderate"}}, {"pk": 3, "model": "marauder.spell", "fields": {"kind": "Defensive", "incantation": "Expelliarmus", "image": "images/expelliarmus.jpg", "creator": "Merlin", "alias": "Disarming Charm", "notable_uses": "Known as the signature spell of Harry Potter, which he used on numerous occasions including the Battle of the Department of Mysteries, Battle of the Seven Potters. This spell was also used against Voldemort when he returned to power and clashed with his killing curse resulting in priori incantatem. Also most famously known to have been the spell which Harry used to rebound Voldemort's killing curse, resulting in the final death of the dark lord.\r\n", "creature": null, "unforgivable": false, "effect": "Shoots a jet of scarlet red light that forces the victim to release whatever they are holding at the time, which is typically a wand. May also know an opponent off their feet. Capable of also rebounding an opponents spell to leave them vulnerable. This spells is a very popular spell typically used in dueling. It was first seen used by Professor Snape when teaching the students how to defend themselves during the scare when the chamber of secrets was opened.", "difficulty": "Easy"}}, {"pk": 4, "model": "marauder.spell", "fields": {"kind": "Charm", "incantation": "Accio", "image": "images/Summoning_charm.gif", "creator": "Merlin", "alias": "Summoning Charm", "notable_uses": "Harry Potter during the Triwizard Tournament, to summon the Portkey to escape Voldemort, to summon brooms for himself and Dumbledore. \r\nDeath Eaters to attempt to retrieve the prophecy from Harry during Battle of the Department of Mysteries By Voldemort to summon the sorting hat\r\n", "creature": null, "unforgivable": false, "effect": "Summons an object to the caster from a distance. Can be done by pointing the wand to the object directly while saying the incantation or by simply saying the incantation and naming the object. Both methods require concentration on the object in question. \r\n", "difficulty": "Moderate"}}, {"pk": 5, "model": "marauder.spell", "fields": {"kind": "Charm", "incantation": "Aguamenti", "image": "images/Aguamenti.gif", "creator": "Unknown", "alias": "Water-Making Spell", "notable_uses": "Fleur Delacroix to extinguish her dress; Harry to attempt to provide water to Dumbledore To attempt to put out Hagrid's hut after another wizard set it on fire.\r\n", "creature": null, "unforgivable": false, "effect": "Causes a jet of water to erupt from the tip of the wand. The caster's level of concentration and desire will affect how the water will manifest. It can range from a trickle to a wave.\r\n", "difficulty": "Moderate"}}, {"pk": 6, "model": "marauder.spell", "fields": {"kind": "Charm", "incantation": "Alohomora", "image": "images/Alohomora.gif", "creator": "Ancient African Sorcerer", "alias": "Unlocking Charm", "notable_uses": " Hermione to unlock the door on the 3rd floor corridor to hid from Filtch", "creature": null, "unforgivable": false, "effect": "unlocks doors or windows that are not protected with the proper spells\r\n", "difficulty": "Easy"}}, {"pk": 7, "model": "marauder.spell", "fields": {"kind": "Jinx", "incantation": "Levicorpus", "image": "images/Levicorpus.jpg", "creator": "Severus Snape", "alias": "Levicorpus Jinx", "notable_uses": "Jame Potter on Severus Snape while they were students\r\n", "creature": null, "unforgivable": false, "effect": "causes the victim to be hoisted into the air by their ankle\r\n", "difficulty": "Moderate"}}, {"pk": 8, "model": "marauder.spell", "fields": {"kind": "Curse", "incantation": "Avada Kedavra", "image": "images/Killing_curse.gif", "creator": "Dark witches or wizards", "alias": "Killing Curse", "notable_uses": "Voldemort on Lily, James, and Harry Potter (failed for Harry twice). Voldemort on an unknown number of other.\r\nMad Eye Moody on spider to fourth year class", "creature": null, "unforgivable": true, "effect": "Instantaneous, painless death ", "difficulty": "Extremely Difficult"}}, {"pk": 9, "model": "marauder.spell", "fields": {"kind": "Defensive", "incantation": "Stupefy", "image": "images/Stupefy.gif", "creator": "Unknown", "alias": "Stunning Spell", "notable_uses": "Battle of the Department of Mysteries. \r\nTaught by Harry to Dumbledore's Army.\r\n To try and take down Rubius Hagrid.\r\n", "creature": null, "unforgivable": false, "effect": "renders a victim unconscious and halts moving objects ", "difficulty": "Moderate"}}, {"pk": 10, "model": "marauder.spell", "fields": {"kind": "Curse", "incantation": "Sectumsempra", "image": "images/Sectumsempra.gif", "creator": "Severus Snape", "alias": "Sectumsempra", "notable_uses": "Harry in a duel with Draco Malfoy, without actually knowing what the spell did. Snape on numerous occasions for Lupin to recognize that it was his specialty, as well as on George Weasley in the battle of the seven Potters.\r\n", "creature": null, "unforgivable": false, "effect": "A rather dangerous curse, when the incantation is uttered its effect is the equivalent of an invisible sword; it is used to slash the victim from a distance, causing rather deep wounds. The slash follows the user's wand movements.[4] Due to the depths of the cut, the victims run the risk of dying from blood loss if treatment is not applied in time, if the wounds are not instantly fatal\r\n", "difficulty": "Hard"}}, {"pk": 1, "model": "marauder.ingredient", "fields": {"name": "Rose Thorn", "creature": null}}, {"pk": 2, "model": "marauder.ingredient", "fields": {"name": "Crushed Moonscope Powder", "creature": null}}, {"pk": 3, "model": "marauder.ingredient", "fields": {"name": "Belladonna Flower Petal", "creature": null}}, {"pk": 4, "model": "marauder.ingredient", "fields": {"name": "Dried Peppermint", "creature": null}}, {"pk": 5, "model": "marauder.ingredient", "fields": {"name": "Juiced Squill Bulb", "creature": null}}, {"pk": 6, "model": "marauder.ingredient", "fields": {"name": "Chopped Murtlap Tentacle", "creature": 9}}, {"pk": 7, "model": "marauder.ingredient", "fields": {"name": "Tincture of Thyme", "creature": null}}, {"pk": 8, "model": "marauder.ingredient", "fields": {"name": "Horseradish", "creature": null}}, {"pk": 9, "model": "marauder.ingredient", "fields": {"name": "Ground Occamy Eggshell", "creature": 8}}, {"pk": 10, "model": "marauder.ingredient", "fields": {"name": "Powdered Common Rue", "creature": null}}, {"pk": 11, "model": "marauder.ingredient", "fields": {"name": "Ashwinder egg", "creature": 7}}, {"pk": 12, "model": "marauder.ingredient", "fields": {"name": "Wormwood", "creature": null}}, {"pk": 13, "model": "marauder.ingredient", "fields": {"name": "Powdered Asphodel Root", "creature": null}}, {"pk": 14, "model": "marauder.ingredient", "fields": {"name": "Sloth Brain", "creature": null}}, {"pk": 15, "model": "marauder.ingredient", "fields": {"name": "Sopophorous Bean Juice", "creature": null}}, {"pk": 16, "model": "marauder.ingredient", "fields": {"name": "Salamander Blood", "creature": null}}, {"pk": 17, "model": "marauder.ingredient", "fields": {"name": "Lionfish Spine", "creature": null}}, {"pk": 18, "model": "marauder.ingredient", "fields": {"name": "Flobberworm Mucus", "creature": 14}}, {"pk": 19, "model": "marauder.ingredient", "fields": {"name": "Honeywater", "creature": null}}, {"pk": 20, "model": "marauder.ingredient", "fields": {"name": "Sliced Bursting Mushrooms", "creature": null}}, {"pk": 21, "model": "marauder.ingredient", "fields": {"name": "Wartcap Powder", "creature": null}}, {"pk": 22, "model": "marauder.ingredient", "fields": {"name": "Shrivelfig", "creature": null}}, {"pk": 23, "model": "marauder.ingredient", "fields": {"name": "Porcupine Quills", "creature": null}}, {"pk": 24, "model": "marauder.ingredient", "fields": {"name": "Sopophorous Beans", "creature": null}}, {"pk": 1, "model": "marauder.potion", "fields": {"physical_description": "Steam rises from Amortentia in coil-like designs. It has a mother-of-pearl luster.", "image": "images/hermione.gif", "ingredients": [1, 2, 3, 4, 11], "title": "Amortentia", "notable_uses": "Amortentia to Hermoine Granger smells like newly cut grass, new parchment, and the hair of Ron Weasley. To Harry Potter, Amortentia smells like a broomstick handle, treacle tarts, and Ginny Weasley.\r\nThere is a large fountain of Amortentia in the Love Room in the Department of Mysteries.", "recipe": "Unknown", "difficulty": "A", "effects": "Amortentia is the  most powerful of the love potions. The scent of the potion differs for everyone. To each person it is a combination of scents representing his or her favorite things in life. The drinker become sickly and pale and immediately possessed by obsession and infatuation."}}, {"pk": 2, "model": "marauder.potion", "fields": {"physical_description": "No color and no odor", "image": "images/250px-Veritaserum.jpg", "ingredients": [], "title": "Veritaserum", "notable_uses": "Veritaserum was used when Albus Dumbledore found out that Barty Crouch Jr. was disguised as Alastor Moody, the Defence Against the Dark Arts teacher.\r\nDolores Umbridge unsuccessfully tried to have Harry drink Veritaserum, however she had received a fake version of the potion from Snape, and Harry had secretly dumped out the potion instead of drinking it.", "recipe": "It must be brewed for 28 days, or one lunar phase.", "difficulty": "A", "effects": "The drinker is forced to answer any question with whatever they believe is the truth. There is an unnamed antidote to Veritaserum, and its effects can be circumvented with Occlumency. Therefore, this potion cannot be considered a reliable indicator of innocence or guilt in a trial. The potion is forbidden to be used against students at Hogwarts, much to Severus Snape's disappointment."}}, {"pk": 3, "model": "marauder.potion", "fields": {"physical_description": "Its color is molten gold. When inside a cauldron, drops of the liquid will leap above the surface.", "image": "images/felixfelices.jpeg", "ingredients": [5, 6, 7, 8, 9, 10, 11], "title": "Felix Felices", "notable_uses": "Hermoine Granger, Ginny Weasley and Ron Weasley used Felix Felices to evade the curses of Death Eaters.\r\nHorace Slughorn used this potion at 24 and 57 years old. It gave him one perfect day each time.", "recipe": "Add to the cauldron an Ashwinder egg and horseradish before heating. Then add a juiced squill bulb and stir. Add chopped Murtlap tentacle to mixture and heat again. Then add a dash of tincture of thyme before stirring slowly. Add ground Occamy eggshell. Stir slowly and heat again. Sprinkle powdered common rue over the mixture before stirring and heating again. Then make a figure-eight motion over the cauldron with the wand and say the incantation, \"\"Felixempra!\"\". Needs to be brewed for six months. ", "difficulty": "A", "effects": "Increases the drinker's luck. Overdose can induce giddiness and recklessness. Large quantities can be toxic.Also called \"\"Liquid Luck\"\", Felix Felices was invented by Zygmunt Budge in the 16th century.The drinker of the potion is given the best scenario possible in their situation, which manifests in an urge or a voice telling them which action to take to ensure the outcome. The potions' effectiveness is limited against powerful enchantments, and wears off over time."}}, {"pk": 4, "model": "marauder.potion", "fields": {"physical_description": "The potion is green in color.", "image": "images/agingpotion.gif", "ingredients": [], "title": "Aging Potion", "notable_uses": "Fred and George Weasley along with Lee Jordan, S. Fawccett and Summers tried to fool the Age Line in front of Goblet of Fire with this potion in order to compete in the Triwizard Tournament. They were unsuccessful and grew beards as a result.\r\n", "recipe": "Unknown", "difficulty": "A", "effects": "The drinker ages temporarily. The amount of aging is proportional to the amount of potion consumed. Asis evident in the  example with the Age Line Dumbledore imposed, this potion is not effective against all magic."}}, {"pk": 5, "model": "marauder.potion", "fields": {"physical_description": "Blazing white with rising steam", "image": "images/regenerationpotion.gif", "ingredients": [], "title": "Regeneration Potion", "notable_uses": "Lord Voldemort used this potion to restore his body. Wormtail took Harry Potter's blood by force to use in the potion, because Voldemort thought Harry's blood would enable him to obtain more power than he had ever possessed. However, Voldemort was not able to kill Harry because his mother's protection from her love was in his blood. ", "recipe": "The three known ingredients are bone taken from the wizard's unwitting father, flesh donated knowingly and willingly by the wizard's servant, and blood from a foe taken by force. ", "difficulty": "A", "effects": "It is a Dark potion. The drinker's damaged or maimed body is returned to its former undamaged state.  \r\n"}}, {"pk": 6, "model": "marauder.potion", "fields": {"physical_description": "It is a pale lilac color before turning clear.", "image": "images/Draught_of_living_death.gif", "ingredients": [12, 13, 14, 15], "title": "Draught of Living Death", "notable_uses": "Leticia Somnolens, a hag, jealously attempted to kill a princess with this potion. A prince used Wiggenweld Potion, which can act as an antidote to this potion, to awaken her.\t", "recipe": "Add Infusion of Wormwood and powdered asphodel root and stir clockwise twice. Add one sloth brain and juice of Sopophorous bean and stir anti-clockwise seven times.", "difficulty": "A", "effects": "The drinker goes into a death-like sleep that does not necessarily have an end.\t\r\n"}}, {"pk": 7, "model": "marauder.potion", "fields": {"physical_description": "Green", "image": "images/Wiggenweld.JPG", "ingredients": [16, 17, 18, 19], "title": "Wiggenweld Potion", "notable_uses": "Leticia Somnolens, a Hag, used the <a href='/potions/6'>Draught of Living Death</a> against a princess to put her into a death-like sleep. A prince put Wiggenweld Potion on his lips and then kissed her to awaken her.", "recipe": "To brew: Add salamander blood, and then stir so that it changes from red to orange. Keep adding more salamander blood and after awhile the potion should turn yellow. Stir the potion until it turns green, and then keep adding salamander blood until it turns turquoise. Heat until the potion takes on an indigo color, and then add salamander blood until it changes to pink. Then the potion needs to be heated until it is red again. Drop in five lionfish spines and heat themixture until it is yellow. Then add yet another five lionfish spines, along with flobberworm mucus, until it is purple. Stir the potion until it is red again. Keep adding flobberworm mucus until the potion is orange, and then stir until it is yellow. Shake the potion until it is orange. Pour in honeywater until it is turquoise, and then heat until it is pink. Finally, keep adding salamander blood until the potion is green, its final state.", "difficulty": "M", "effects": "Wiggenweld can cure non-serious ailments and revive a person from sleep brought on by magic. It acts as an antidote to the Draught of Living Death. \r\n"}}, {"pk": 8, "model": "marauder.potion", "fields": {"physical_description": "Sweet and has a pleasant aroma", "image": "images/stone.gif", "ingredients": [], "title": "Elixir of Life ", "notable_uses": "Nicholas Flamel, the inventor of the Philosopher's Stone, used the potion to extend his and his wife's lives. They died after 660 years when the Stone was destroyed and they were unable to make any new elixir.\r\nLord Voldemort attempted to use the Elixir of Life to replace his severely weakened body with a new one.\r\n\r\n\r\n", "recipe": "This elixir is made with the Philosopher's stone. According to Dumbledore, it is possible for the Philosopher's Stone over time to degrade and become unable to produce the elixir.", "difficulty": "A", "effects": "This elixir will extend the life of the drinker indefinitely until they stop consuming it on a regular basis. It can also provide a body-less soul on Earth with a body.  "}}, {"pk": 9, "model": "marauder.potion", "fields": {"physical_description": "Either black or purple in color", "image": "images/Ice_Potion.png", "ingredients": [16, 20, 21], "title": "Fire Protection Potion", "notable_uses": "Harry Potter and Quirinus Quirrell used the Fire Protection Potion to bypass the flames guarding the most hidden Underground Chambers in order to get to the Philosopher's Stone. ", "recipe": "Add sliced bursting mushrooms to the cauldron and stir the mixture clockwise until the potion is blue. Add the blood of a salamander and stir counter-clockwise until it turns from blue to green. Add Wartcap powder that has been crushed with a pestle, and stir clockwise until the potion changes from green to red.", "difficulty": "E", "effects": "This potion renders the drinker impervious to fire. It is guaranteed to work against most, but not all, magically-induced fires. The Fire Protection Potion is also known as the Ice Potion, because the drinker will feel like their body is being frozen or flooded by ice.  \r\n"}}, {"pk": 10, "model": "marauder.potion", "fields": {"physical_description": "Bright yellow and gives off a rainbow when it is done working", "image": "images/euphoria.png", "ingredients": [12, 22, 23, 24], "title": "Elixir to Induce Euphoria", "notable_uses": "During Professor Slughorn's class, Harry Potter prepared this potion with the goal of somehow getting the professor to drink it. He hoped that the euphoria would make the professor amenable to sharing his memory about Voldemort.", "recipe": "Add Shrivelfig and Porcupine quills to the cauldron, and then stir counter-clockwise four times. Then add Wormwood and Sopophorous beans and stir counter-clockwise six times. A peppermint sprig can be added to the potion to counteract some of its more embarrassing side-effects.", "difficulty": "A", "effects": "This potion grants the drinker sudden, irrational euphoria. It will cure depression. Possible side-effects include nose-tweaking and bursting into song.\t"}}, {"pk": 1, "model": "marauder.location", "fields": {"name": "Hogwarts School of Witchcraft and Wizardry", "kind": "School", "image": "images/hogwarts.gif", "description": "Hogwarts School of Witchcraft and Wizardry is a boarding school for young witches and wizards. Students can study subjects such as Charms, Potions, Defense Against the Dark Arts, Transfiguration, Herbology, Muggle Studies, Divination, Care of Magical Creatures, and Arithmancy. Hogwarts is a castle near the Black Lake, the Forbidden Forest, a quidditch field, and the magical village of Hogsmeade. Hogwarts has high towers and 142 staircases, which move around as to confuse the students and make them late for class. Some of the rooms move around as well. No one knows the exact location of Hogwarts since it is unplottable, in order to protect the students and faculty as well as guard its secrets. Witches and wizards are also not allowed to apparate or disapparate within the grounds, unless the enchantment is lifted by the headmaster.\r\n\r\nHogwarts was founded around 990 AD by Godric Gryffindor, Helga Hufflepuff, Rowena Ravenclaw, and Salazar Slytherin. Each founded their own respective houses and preferred a set of students similar to their own personalities. Once the others discovered that Slytherin discriminated against non-pure-blood students, they had a falling out and Slytherin left but not before building the Chamber of Secrets.\r\n\r\nThe school's motto is Draco Dormiens Nunquam Titillandus, which is Latin for \"Never tickle a sleeping dragon.\""}}, {"pk": 3, "model": "marauder.location", "fields": {"name": "Gryffindor", "kind": "house", "image": "images/gryffindor.jpg", "description": "<p>Gryffindor is one of the four houses at Hogwarts, founded by Godric Gryffindor. The house prizes bravery, courage, nerve, chivalry, determination, and daring in their students. Its colors are red and gold, and its symbol is the lion. Its house ghost is Sir Nicholas de Mimsy-Porpington, also known as \"Nearly-Headless Nick.\" Gryffindor and Slytherin houses are fierce rivals.</p>\r\n\r\n<p>The Gryffindor common room is located in one of the castle's towers, the entrance to which is guarded by an oil painting known as the Fat Lady. One must say the right password, which changes frequently, in order to enter.</p>"}}, {"pk": 4, "model": "marauder.location", "fields": {"name": "Slytherin", "kind": "house", "image": "images/slytherin.jpg", "description": "Slytherin is one of the four houses at Hogwarts, founded by Salazar Slytherin. The house prizes cunning, resourcefulness, ambition, leadership, self-preservation, determination, cleverness, fraternity, and power in their students. Its colors are green and silver, and its symbol is the serpent. Its house ghost is the Bloody Baron. Slytherin and Gryffindor houses are fierce rivals. Most Slytherin students are pure-blood, due to the founder's mistrust of Muggle-born witches and wizards. Slytherin has a bad reputation as it is known that most dark wizards and witches are produced from Slytherin house. Most notably, Tom Marvolo Riddle, who later became Lord Voldemort, and most of his Death Eater followers were Slytherins.\r\n\r\n\r\nThe Slytherin common room is located in the dungeons underneath the Black Lake. To enter, one must say the correct password in front of a stone wall, which will then reveal a concealed stone door."}}, {"pk": 5, "model": "marauder.location", "fields": {"name": "Borgin and Burkes", "kind": "shop", "image": "images/handofglory_1.gif", "description": "<p>A small shop that typically sells trinkets and artifacts, most, if not all, of which have dark purposes as they are typically associated with dark magic.</p>\r\n\r\n<p>Draco Malfoy visited this shop again in early August of 1996 to force Borgin to help him repair a broken Vanishing Cabinet, the partner of which was in the shop. Draco also bought the Hand of Glory and a cursed opal necklace. When Draco left, Borgin was visibly shaken, though when Hermione Granger entered minutes later with a poor attempt to investigate Draco's doings, Borgin angrily expelled her from the store. The Vanishing Cabinet Draco wanted to repair was located at Hogwarts Castle. A group of Death Eaters used the Vanishing Cabinet at Borgin and Burkes to enter Hogwarts Castle at the end of the same school year.</p>"}}, {"pk": 6, "model": "marauder.location", "fields": {"name": "Hufflepuff", "kind": "House", "image": "images/hufflepuff_1.jpg", "description": "Hufflepuff is one of the four houses at Hogwarts, founded by Helga Hufflepuff. The house prizes dedication, hard work, fair play, patience, kindness, tolerance, honestly, and loyalty in their students. Its colors are yellow and black, and its symbol is the badger. Its house ghost is the Fat Friar. Hufflepuff appears to have the least rivalry with the other houses, possibly as they are less competitive or humble about their accomplishments due to their house traits. Due to Helga Hufflepuff's policy of accepting any student, Hufflepuff is often thought as the house with the less talented wizards, even though there have been exceptional witches and wizards from Hufflepuff. It is also notable that Hufflepuff has produced less dark wizards than any other house at Hogwarts.\r\n\r\n\r\nThe Hufflepuff common room has never been seen by outsiders and is the only house with repelling devices. Its entrance is located somewhere near the kitchens."}}, {"pk": 7, "model": "marauder.location", "fields": {"name": "Godric's Hollow", "kind": "location", "image": "images/godrics-hollow.gif", "description": "<p>Godric's Hollow is a village in the West Country of England. It is a small community, which centres on a village square with only a church, a post office, a pub, and a few retail shops. The residential streets are lined with quaint cottages, and an are called Church Lane that leads up to the church.</p>\r\n\r\n<p>Godric's Hollow has been inhabited by a number of notable wizarding families. The Dumbledore family and Bathilda Bagshot both resided in the village, but it is perhaps most famous as where Harry Potter and his parents lived when he was a baby, and where they were murdered and Voldemort met his first downfall. Thus, the village is notable as the place where Harry Potter became known as \"the Boy Who Lived\". Despite this, Harry did not visit until Christmas of 1997. According to A History of Magic, the graveyard is rumored to be haunted. </p>"}}, {"pk": 8, "model": "marauder.location", "fields": {"name": "Ministry of Magic", "kind": "government", "image": "images/ministry-of-magic.png", "description": "<p>The Ministry of Magic is the main governing body of the magical community of Great Britain with the intention of preservation of magical law. The Ministry connects the British government to the wizarding world. The headquarters of the Ministry are in Whitehall, in central London, deep underground.[2] It is headed by the Minister for Magic. The current Minister in Britain is Kingsley Shacklebolt.</p>\r\n\r\n<p>The Ministry of Magic was formed as a successor to the earlier Wizards' Council and came into being sometime during the 1600s. It was involved in the International Confederation of Wizards' decision to create the Statute of Secrecy and still today takes the responsibility of enforcing said Statute. The laws against magic-use by underage wizards and against wand use by non-wizard folk are also enforced by the Ministry, in part to maintain secrecy.</p>\r\n\r\n<p>Other countries, such as Norway, Germany, Bulgaria, etc., have their own Ministries of Magic.</p>"}}, {"pk": 9, "model": "marauder.location", "fields": {"name": "Azkaban", "kind": "Prison", "image": "images/azkaban.gif", "description": "<p>Azkaban, also known as Azkaban Prison, is a prison on an island in the middle of the North Sea. It serves the magical community of Great Britain. Using certain Charms, the prison is hidden from the muggle world, and is unplottable. It is thought to have undetectable extension charms placed on it (or similar types of magic) to make it bigger on the inside, as the prison seems to serve the whole of wizarding Britain. Although other wizarding prisons exist, such as Nurmengard (which was used exclusively to hold its creator Gellert Grindelwald), Azkaban is the only known fortress to be the \"official\" holding ground for wizarding criminals.</p>\r\n\r\n<p>Azkaban gained a reputation as a horrible place, mostly due to the prison's guards: Dementors, foul creatures that suck the happiness out of the victim and cause great suffering to those near them. Because of this, most of the prisoners eventually went insane and slowly died under the Dementors' influence. Since 1717, using any of the three Unforgivable Curses on another human being has carried a punishment of a life sentence in Azkaban (unless there is sufficient evidence that the caster did so under the influence of the Imperius Curse, or legal exceptions made by the Ministry of Magic as in the case of Aurors in the First Wizarding War).</p>"}}, {"pk": 10, "model": "marauder.location", "fields": {"name": "12 Grimmauld Place", "kind": "Residence", "image": "images/12-grimmauld-place.gif", "description": "<p>12 Grimmauld Place was the ancestral home of the Black family. It was located in the Borough of Islington, London, in a Muggle neighbourhood, and the location was protected by a Fidelius Charm. As the house was invisible to the neighbourhood residents, the local Muggles have long since accepted the mistake in numbering which landed number 13 next to number 11.</p>\r\n\r\n<p>In 1995, the home became the headquarters for the Order of the Phoenix with the consent of Sirius Black, with Albus Dumbledore becoming Secret-Keeper. After Dumbledore's death in 1997, everyone in whom he confided the location of 12 Grimmauld Place to became a Secret-Keeper. </p>"}}, {"pk": 11, "model": "marauder.location", "fields": {"name": "The Burrow", "kind": "Residence", "image": "images/the-burrow.gif", "description": "The Burrow was the family home of the Weasley family. Located on the outskirts of Ottery St. Catchpole in Devon, England, it was a thoroughly magical dwelling that became a second home to Harry Potter. The Burrow is held up with magic and is very cluttered inside, but very welcoming at the same time. In 1997, following the death of Albus Dumbledore, The Burrow became the Headquarters of the Order of the Phoenix. The Weasleys were forced to abandon their home during the height of the Second Wizarding War when they became targets of the Death Eaters. "}}, {"pk": 12, "model": "marauder.location", "fields": {"name": "Room of Requirement", "kind": "Classroom", "image": "images/room-of-requirement.gif", "description": "The Room of Requirement, also known as the Come and Go Room, is a secret room within Hogwarts Castle, that only appears when a person is in great need of it. The room is thought to have some degree of sentience, because it transforms itself into whatever the witch or wizard needs it to be at that moment in time, although there are some limitations. For example, it cannot create food, as that is one of the five Principal Exceptions to Gamp's Law of Elemental Transfiguration. It is believed that the room is Unplottable, as it does not appear on the Marauder's Map, nor do its occupants, although this could simply be because James Potter, Remus Lupin, Sirius Black, and Peter Pettigrew never found the room. "}}, {"pk": 13, "model": "marauder.location", "fields": {"name": "Weasley's Wizard Wheezes", "kind": "shop", "image": "images/weasly-wheezes.gif", "description": "<p>Weasleys' Wizard Wheezes, also known as Weasley and Weasley is a joke shop located at Number 93 Diagon Alley founded by Fred and George Weasley.</p>\r\n\r\n<p>The shop contains practical joke objects, such as; Extendable Ears, a Reusable Hangman, Skiving Snackboxes, and Fred and George's special WonderWitch products, such as; Love Potions, Ten-Second Pimple Vanishers, and  Pygmy Puffs. There is also a section of Muggle Magic Tricks \"for freaks like Dad\"[HP6], which are said to do steady business, despite not being big sellers. The shop also sells a number of defensive magical objects. This establishment started out as an 'owl-post service' led by the twins from The Burrow, (later continued from Hogwarts), selling joke-products until the final shop was opened. </p>\r\n\r\n<p>While still students at Hogwarts, Fred and George were inspired to develop a number of practical joke products, which they initially developed in their room at The Burrow. Their initial efforts were sold as mail-order items using owl post. Their mother discovered the orders while cleaning their room one day. She didn't support their wild ambitions, considering that most of the products that they'd created were dangerous, and wished them to get jobs in the Ministry of Magic like their father. Even though she burned the orders, her twin sons still maintained their ambition to open a joke shop. To raise money for their shop, they bet their life's savings with Ludo Bagman on the outcome of the Quidditch World Cup. They won, but Bagman paid them off with Leprechaun gold, which vanished after a few hours, wiping out their savings, and putting their dream in peril.</p>\r\n\r\n<p>After releasing their Weasleys' Wildfire Whiz-bangs and Portable Swamp on school grounds and defecting from Hogwarts as to rebel against Dolores Umbridge's tyrannical rule, the twins set off to Diagon Alley to fulfill their dreams of opening a joke shop, with the winnings of the Triwizard Tournement that Harry Potter gave to them. </p>"}}, {"pk": 14, "model": "marauder.location", "fields": {"name": "Ollivander's Wand Shop", "kind": "shop", "image": "images/ollivander.gif", "description": "<p>Ollivanders Wand Shop in South Side, Diagon Alley, London, is owned by the Ollivander family and run by an older family member Garrick Ollivander, known only as Mr. Ollivander. Mr. Ollivander has been serving as the family shopkeeper at least since the 1930s, and remembers every wand he's ever sold. The Ollivander family are widely acknowledged to be the best wandmakers in Britain, and rank among the finest wandmakers in Europe. Wandmaking has been the family business since 382 B.C. Although there are other wandmakers in Britain, most new British wands are purchased from Ollivanders, including almost all first wands purchased by incoming Hogwarts students. There is also an Ollivanders Wand Shop in Hogsmeade.</p>\r\n\r\n<p>It is believed by Garrick Ollivander, a descendant of the original Ollivander, that the founder of Ollivanders Wand Shop arrived with the Romans, setting up a stall (which, in due course, evolved into a shop) to manufacture and sell wands to the ancient British wizards, whose wands were crudely-made and inferior in quality and performance.</p>"}}, {"pk": 15, "model": "marauder.location", "fields": {"name": "Diagon Alley", "kind": "Shopping District", "image": "images/diagon-alley.gif", "description": "<p>Diagon Alley is a cobbled wizarding alley and shopping area located in London, England behind a pub called the Leaky Cauldron. Inside the alley is an assortment of restaurants, shops, and other sights. All items on the Hogwarts supply list can be bought at Diagon Alley. The alley is completely hidden from the Muggle world which is right outside of its boundaries. It is very large in area and essentially the centre of wizarding London.</p>\r\n\r\n<p>It is a popular historical theory that the oldest building in Diagon Alley is Gringotts Wizarding Bank and that the other shops grew up around it. However, there is a possibility that Ollivanders Wand Shop is the oldest building, records dating back to the late fourth century B.C.</p>"}}, {"pk": 16, "model": "marauder.location", "fields": {"name": "Knockturn Alley", "kind": "Shopping District", "image": "images/knockturn-alley.gif", "description": "<p>Knockturn Alley is a shopping area off Diagon Alley in London. It is filled with lots of shops devoted to the Dark Arts, including Borgin and Burkes, which specialises in objects that have curious and strong magical properties. Usually, unusual, dangerous and scary people walk around there. When Tom Riddle left Hogwarts he worked at Borgin and Burkes.</p>\r\n\r\n<p>From the shops, one can purchase many types of dark objects, which include poisonous candles, shrunken heads, giant spiders, human-looking fingernails and toenails, and Flesh-Eating Slug Repellent.</p>"}}, {"pk": 17, "model": "marauder.location", "fields": {"name": "Hogsmeade", "kind": "Village", "image": "images/hogsmeade.gif", "description": "<p>Hogsmeade Village, or simply called Hogsmeade is the only all-wizarding village in Britain. It was founded by Hengist of Woodcroft. Students may sometimes come on weekend trips, but only third year students and above with guardian permission are allowed to visit. Mainly, students frequent the High Street in the village which contains the named specialty shops and pubs such as Zonko's Joke Shop and Honeydukes. Otherwise, they wander on to observe the infamous Shrieking Shack.</p>\r\n\r\n<p>Hogsmeade is a picturesque little village of cottages and shops, with enchanted candles hanging in the trees during the holidays. It is also near the location of the train station used by the Hogwarts Express.</p> \r\n\r\n<p>According to tradition, Hogsmeade was founded over a thousand years ago, around the same time as Hogwarts School of Witchcraft and Wizardry, by medieval wizard Hengist of Woodcroft as he was fleeing persecution by Muggles.</p>"}}, {"pk": 18, "model": "marauder.location", "fields": {"name": "Ravenclaw", "kind": "House", "image": "images/ravenclaw.jpg", "description": "Ravenclaw is one of the four houses at Hogwarts, founded by Rowena Ravenclaw. The house prizes learning, wit, wisdom, creativity, individuality, tolerance, and intellect in its students. Its house colors are blue and bronze, and its symbol is the eagle. The house ghost is the Grey Lady, the daughter of Rowena Ravenclaw.\r\n\r\nThe Ravenclaw common room is located in a high tower, which one may only enter after solving a logical riddle given by a bronze eagle-shaped knocker. This could be considered troublesome, since anyone with enough intellect could enter the tower, Ravenclaw or not, and this has happened before. However, most witches and wizards lack a sense of logic, which may be why Rowena chose to set up the security this way."}}, {"pk": 19, "model": "marauder.location", "fields": {"name": "Beauxbatons Academy of Magic", "kind": "School", "image": "images/beauxbatons-academy-of-magic.gif", "description": "Beauxbatons Academy of Magic is a wizarding school for both young witches and wizards located at a palace in the Pyrenees of France surrounded by gardens, mountains, and magical fountains. One of the fountains is named after Nicolas Flamel and his wife Perenelle alumni who met while studying here. Students are accepted from France, Spain, Portugal, Luxembourg, Belgium, and the Netherlands. The students at Beauxbatons have great respect for their headmistress, standing at attention whenever she enters the room."}}, {"pk": 20, "model": "marauder.location", "fields": {"name": "Durmstrang Institute", "kind": "School", "image": "images/durmstrang-institute.gif", "description": "Durmstrang Institute is a wizarding school located somewhere in north of Sweden or Norway. Like Hogwarts, the school is unplottable and hence the exact location is unknown. Since they arrived by ship for the 1994-1995 Triwizard Tournament at Hogwarts, it is probable that they are near a sea, river, or major lake. \r\n\r\nDurmstrang has a reputation for attracting dark witches and wizards, and it does not accept Muggle-born students. They are known to teach the Dark Arts and Gellert Grindelwald, an incredibly dark wizard, studied here. Former headmaster Igor Karkaroff was a known Death Eater, a follower of Lord Voldemort, who escaped Azkaban by cooperating with the Ministry of Magic.\r\n\r\nDurmstrang Institute was founded sometime in the Middle Ages by Nerida Vulchanova. Professor Harfang Munter took over quickly after she mysteriously died, and he is the one who changed the school curriculum to focus on martial arts and dueling."}}, {"pk": 21, "model": "marauder.location", "fields": {"name": "Potage's Cauldron", "kind": "shop", "image": "images/potages.jpg", "description": "Potage's Cauldron Shop sells different varieties and sizes of cauldrons, including copper, brass, pewter, silver, self-stirring, collapsible, and solid gold, according to a sign outside the shop. Hogwarts requires its students to have a size 2 pewter cauldron (as listed in the Philosopher's Stone book list). The Cauldron Shop is very near to the entrance from The Leaky Cauldron."}}, {"pk": 22, "model": "marauder.location", "fields": {"name": "Quality Quidditch Supplies", "kind": "shop", "image": "images/nimbus2000.jpg", "description": "Quality Quidditch Supplies sells broomsticks and Quidditch-related items. The store windows often draw young customers to gaze longingly at the merchandise. Its most famous items on display are the Nimbus 2000 and the Firebolt broomsticks, both of which Harry would eventually own. He spent the summer before his third year gazing at the brand new Firebolt racing broom in the display window, the price of which was only available upon request. Ron had previously longed for a full set of Chudley Cannons robes offered at the shop."}}, {"pk": 23, "model": "marauder.location", "fields": {"name": "Gambol and Japes", "kind": "shop", "image": "images/Gambol.jpg", "description": "Gambol and Japes Wizarding Joke Shop is a shop located in South Side, Diagon Alley. It sells a wide range of joke items and other stuff serving mainly as an entertainment. It is presumably the favourite shop of Fred and George Weasley, and Lee Jordan. It was there that they stocked up on Dr. Filibuster's Fabulous Wet-Start, No-Heat Fireworks in 1992. It is run by a man with a white beard and moustache. It was located between Obscurus Books and Twilfit and Tattings."}}, {"pk": 24, "model": "marauder.location", "fields": {"name": "Slug and Jiggers Apothecary", "kind": "shop", "image": "images/Slug-Jigglers-Apothecary.jpg", "description": "The Apothecary sells scales, potions and potion ingredients. The shop is quite fascinating despite its very bad smell (a mixture of bad eggs and rotten cabbage). The inside includes barrels of slimy stuff on the floor, jars of herbs, dried roots and bright powders on the shelves, and bundles of feathers, strings of fangs and snarled claws hanging from the ceiling. Harry regularly buys ingredients, as well as his scales, from the Apothecary.\r\n\r\nSome of the ingredients available are silver unicorn horns (for twenty-one Galleons each), glittery-black beetle eyes (five Knuts a scoop), Dragon liver (seventeen Sickles an ounce)."}}, {"pk": 25, "model": "marauder.location", "fields": {"name": "Wiseacre's Wizarding Equipment", "kind": "shop", "image": "images/locations/wiseacres-wizarding-equipment.jpeg", "description": "Wiseacre's Wizarding Equipment was a shop in North Side, Diagon Alley that sold a wide variety of magical instruments like telescopes and hourglasses. There was also a local branch in Hogsmeade."}}, {"pk": 26, "model": "marauder.location", "fields": {"name": "Twilfitt and Tatting's", "kind": "shop", "image": "images/locations/twilfitt-and-tattings.jpeg", "description": "Twilfitt and Tatting's is a wizarding clothing shop located in Diagon Alley, mentioned in Half-Blood Prince by Narcissa Malfoy, who claims she would shop there rather than shopping in Madam Malkin's due to the presence of Harry, Ron, and Hermione."}}, {"pk": 27, "model": "marauder.location", "fields": {"name": "Magical Menagerie", "kind": "shop", "image": "images/locations/magical-menagerie.jpeg", "description": "The Magical Menagerie is a shop in North Side, Diagon Alley. It is very cramped and noisy with every inch of wall covered by cages. It sells all kinds of animals - poisonous orange snails, a giant jewel-encrusted tortoise, sleek black rats that are very intelligent, owls, ravens, cats of every colour, Puffskeins, a Transforming Rabbit and much more.\r\n\r\nIt was there that Ron Weasley gets some Rat tonic for his pet rat, Scabbers, (who was really Peter Pettigrew, hiding in his animagus form) and Hermione Granger gets her cat/Kneazle crossbreed, Crookshanks."}}, {"pk": 28, "model": "marauder.location", "fields": {"name": "Eeylops Owl Emporium", "kind": "shop", "image": "images/eeylops-owl-emporium.jpeg", "description": "Eeylops Owl Emporium sells owls and supplies such as owl treats and cages. Inside, it is dark and full of soft hooting, rustling, and the flickering of \"jewel-bright eyes.\" It is here that Rubeus Hagrid purchased Harry's snowy owl, Hedwig, as a birthday gift in The Philosopher's Stone."}}, {"pk": 29, "model": "marauder.location", "fields": {"name": "Hog's Head Inn", "kind": "shop", "image": "images/hogs-head-inn_1.jpg", "description": "The Hog's Head Inn is an inn and pub in the all wizarding village of Hogsmeade. The bar at the Hog's Head comprises one small, very dirty, and dingy room that has bay windows that are so encrusted with filth that you can barely see through them. The place is filled with rough wooden tables that generally have nothing except the stubs of candles sitting upon their surfaces. The stone floor of the place is so dirty that it looks as though there is not a floor at all, but instead that the building is simply built on open ground. The Hog's Head is owned and operated by Aberforth Dumbledore. "}}, {"pk": 1, "model": "marauder.school", "fields": {"country": "Scotland"}}, {"pk": 3, "model": "marauder.school", "fields": {"country": "Scotland"}}, {"pk": 4, "model": "marauder.school", "fields": {"country": "Scotland"}}, {"pk": 6, "model": "marauder.school", "fields": {"country": "Scotland"}}, {"pk": 18, "model": "marauder.school", "fields": {"country": "Scotland"}}, {"pk": 19, "model": "marauder.school", "fields": {"country": "France"}}, {"pk": 20, "model": "marauder.school", "fields": {"country": "Sweden or Norway"}}, {"pk": 3, "model": "marauder.house", "fields": {"ghost": 1, "quote_by": "The Sorting Hat", "school": 1, "mascot": "lion", "founder": 2, "colors": "red and gold", "quote": "You might belong in Gryffindor,<br/>\r\nWhere dwell the brave at heart,<br/>\r\nTheir daring, nerve and chivalry<br/>\r\nSet Gryffindors apart."}}, {"pk": 4, "model": "marauder.house", "fields": {"ghost": 11, "quote_by": "The Sorting Hat", "school": 1, "mascot": "serpent", "founder": 12, "colors": "green and silver", "quote": "Or perhaps in Slytherin,<br/>\r\nYou'll make your real friends,<br/>\r\nThose cunning folk use any means,<br/>\r\nTo achieve their ends."}}, {"pk": 6, "model": "marauder.house", "fields": {"ghost": 18, "quote_by": "The Sorting Hat", "school": 1, "mascot": "Badger", "founder": 19, "colors": "Yellow and Black", "quote": "You might belong in Hufflepuff,\r\nWhere they are just and loyal,\r\nThose patient Hufflepuffs are true,\r\nAnd unafraid of toil.\r\n"}}, {"pk": 18, "model": "marauder.house", "fields": {"ghost": 48, "quote_by": "The Sorting Hat", "school": 1, "mascot": "eagle", "founder": 49, "colors": "blue and bronze", "quote": "Or yet in wise old Ravenclaw,\r\nIf you've a ready mind,\r\nWhere those of wit and learning,\r\nWill always find their kind."}}, {"pk": 5, "model": "marauder.shop", "fields": {"locations": [16]}}, {"pk": 13, "model": "marauder.shop", "fields": {"locations": [15, 17]}}, {"pk": 14, "model": "marauder.shop", "fields": {"locations": [15, 17]}}, {"pk": 21, "model": "marauder.shop", "fields": {"locations": [15, 16, 17]}}, {"pk": 22, "model": "marauder.shop", "fields": {"locations": [15]}}, {"pk": 23, "model": "marauder.shop", "fields": {"locations": [15]}}, {"pk": 24, "model": "marauder.shop", "fields": {"locations": [15]}}, {"pk": 25, "model": "marauder.shop", "fields": {"locations": [15, 17]}}, {"pk": 26, "model": "marauder.shop", "fields": {"locations": [15]}}, {"pk": 27, "model": "marauder.shop", "fields": {"locations": [15]}}, {"pk": 28, "model": "marauder.shop", "fields": {"locations": [15]}}, {"pk": 29, "model": "marauder.shop", "fields": {"locations": [17]}}, {"pk": 1, "model": "marauder.artifact", "fields": {"kind": "", "image": "images/pensieve_1.gif", "shop": null, "name": "Pensieve", "owners": [6, 14], "description": "The Pensieve is an object used to review memories. It has the appearance of a shallow stone basin, into which are carved runes and strange symbols. It is filled with a silvery substance that appears to be a cloud-like liquid/gas, the collected memories of people who have siphoned their recollections into it. Memories can then be viewed from a non-participant, third-person point of view."}}, {"pk": 2, "model": "marauder.artifact", "fields": {"kind": "deathly hallow", "image": "images/elder-wand.gif", "shop": null, "name": "Elder Wand", "owners": [6, 7, 17], "description": "It is said to be the most powerful wand that has ever existed, able to perform feats of magic that would normally be considered impossible, such as mending another wand damaged beyond normal magical repair. It is known that the Elder Wand's core is the tail hair of a Thestral, a potent yet tricky substance to master that can only be handled by a witch or wizard who is capable of accepting death, since only by such can it be seen."}}, {"pk": 3, "model": "marauder.artifact", "fields": {"kind": "deathly hallow", "image": "images/invisibility-cloak.gif", "shop": null, "name": "Invisibility Cloak", "owners": [6, 7], "description": "An invisibility cloak is a magical garment which renders whatever it covers unseeable. They may be made from hair of Demiguise, a magical creature that possesses the power to become invisible. This property is used to make the wearer of the cloak invisible. However, as Xenophilius Lovegood tells Harry, Ron, and Hermione, such a cloak will gradually lose its effectiveness as the hair becomes more and more opaque. The cloak can also be formed from an ordinary traveling cloak, enchanted with an exceptionally strong disillusionment charm or a bedazzling hex. The cloak is also mentioned by being one of the entities in the Deathly Hallows. In the story the third brother asked for a way to hide from Death so Death himself gave the brother the cloak of invisibility."}}, {"pk": 4, "model": "marauder.artifact", "fields": {"kind": "unique", "image": "images/deluminator.gif", "shop": null, "name": "Deluminator", "owners": [6, 16], "description": "The Deluminator, also known as the Put-Outer, is a device used by Albus Dumbledore (the first known owner and designer of the one Deluminator known to exist) to remove light sources from the Deluminator's immediate surroundings, as well as bestow them. It looks like a standard silver cigarette lighter. Dumbledore left the Deluminator to Ron Weasley, in his will, after his death."}}, {"pk": 5, "model": "marauder.artifact", "fields": {"kind": "unique", "image": "images/gryffindors-sword_1.gif", "shop": null, "name": "Sword Of Gryffindor", "owners": [2, 6, 7], "description": "<p>The Sword of Gryffindor was a goblin-made sword owned by the famed wizard Godric Gryffindor, one of the four founders of Hogwarts School of Witchcraft and Wizardry.</p>\r\n\r\n<p>The sword was made to Gryffindor's specifications by Ragnuk the First, King of the Goblins. When it was finished, Ragnuk coveted it so much that he pretended Gryffindor had stolen it from him and sent minions to steal it back; however, Gryffindor bewitched the minions rather than killing them, and sent them back to Ragnuk to deliver the message that if Ragnuk ever tried to steal from Gryffindor again, the latter would unsheathe the sword against all the goblins.</p>\r\n\r\n<p>In the Battle of Hogwarts, the sword reappeared in the Sorting Hat for Neville Longbottom and he used it to behead Nagini, Voldemort's snake and his last remaining Horcrux, rendering Voldemort a mortal man once more. The sword was last mentioned lying beside Neville in the Great Hall following the conclusion of the battle. </p>"}}, {"pk": 6, "model": "marauder.artifact", "fields": {"kind": "cursed", "image": "images/horcrux_1.gif", "shop": 5, "name": "Salazar Slytherin's Locket", "owners": [7, 12], "description": "<p>Salazar Slytherin's locket was a piece of jewelery originally owned by Salazar Slytherin that became an heirloom of his family. It was a locket of heavy gold with a serpentine S in glittering green stone inlay on the front. After descending down from Slytherin, it came into the possession of the Gaunt family, and Marvolo Gaunt treasured this heirloom of this pure-blood heritage along with his ring heirloom. After Marvolo and his son Morfin Gaunt were sent to Azkaban, the locket was stolen by Marvolo's daughter Merope Gaunt, who sold it to Caractacus Burke for ten Galleons, a price far below what the priceless artefact was truly worth.</p>\r\n\r\n<p>The locket was bought from Burke's shop, Borgin and Burkes, by a wealthy witch with an affinity for rare or valuable items named Hepzibah Smith. In the mid-Twentieth century, Smith showed it to a young Tom Riddle, an employee of Borgin and Burkes whose job it was to get people to sell their treasures to the shop, though Hepzibah was firm that she was not selling the locket. Riddle was clearly interested in the locket (which was, after all, his birthright), and two days later, Hepzibah was found dead and her house-elf, Hokey, made a full confession (Riddle presumably performed a False Memory Charm on her, as he did with his uncle Morfin years earlier). Using the murder of a Muggle tramp, Riddle turned the locket into his third Horcrux and hid it in a seaside cave. It was taken from the cave, however, by a defected Death Eater named Regulus Black with the attempt of having his house-elf, Kreacher, destroy it, but the elf was unable to.</p>\r\n\r\n<p>It was stolen from 12 Grimmauld Place, the home of the House of Black where Kreacher had kept it, by Mundungus Fletcher, who pillaged the house for valuable heirlooms after the last member of the Black family, Sirius, died. During Harry Potter, Ronald Weasley, and Hermione Granger's attempts to find and destroy Voldemort's Horcruxes, they decided to track down the locket first after retrieving the fake one placed by Regulus from the cave. They learned from Mundungus that it was taken from him by a Ministry bureaucrat named Dolores Umbridge, and thus the trio infiltrated the Ministry, found Umbridge, and retrieved the locket. Ron retrieved Godric Gryffindor's Sword from the bottom of a frozen pool (after Harry was almost killed by the Horkrux while attempting to bring the sword up) and was able to destroy the Horcrux with it (the sword was imbued with Basilisk venom, one of the few substances capable of destroying Horcruxes) in the winter of 1997.</p>"}}, {"pk": 7, "model": "marauder.artifact", "fields": {"kind": "unique", "image": "images/sorting-hat.gif", "shop": null, "name": "Sorting Hat", "owners": [2], "description": "<p>The Sorting Hat is a sentient Hogwarts artefact which magically determines to which of the four school Houses each new student is to be assigned. These four Houses are Gryffindor, Hufflepuff, Ravenclaw and Slytherin.</p>\r\n\r\n<p>The Sorting Hat originally belonged to Godric Gryffindor, one of the founders of Hogwarts. It normally stays in the Headmaster's office until it is needed; Harry Potter talked to the Sorting Hat for the second time when he was sent to Dumbledore's office for the first time in his second year.</p>\r\n\r\n<p>During the opening banquet at the beginning of each school year, the first-year students are lined up and their names read aloud alphabetically. Each then takes a seat on a stool and the hat is placed on her or his head. The hat is battered and old; it's patched, frayed, and extremely dirty. In order to speak and sing, a tear along the brim opens like a mouth. It speaks inside of the hat with a small, quiet voice to the wearer and it can use Legilimency to interpret their thoughts and respond to them.[1] After a moment of consideration, the hat announces its choice aloud for all to hear, and the student joins the selected house. The moment of consideration varies in length, from nearly five minutes (known as \"hatstall\") to less than a second. Judging from Harry's own account of his Sorting, and a brief comment made by Hermione, the hat may sometimes speak to the student during the Sorting.</p>"}}, {"pk": 8, "model": "marauder.artifact", "fields": {"kind": "deathly hallow", "image": "images/resurrection.gif", "shop": null, "name": "Resurrection Stone", "owners": [6, 7, 12, 24], "description": "The Resurrection Stone was one of the three Deathly Hallows, originally in the possession of Cadmus Peverell. In layman's terms, it gave its owner the power to bring back a form of the dead. To be specific, when the Resurrection Stone is flipped over three times in one's hand, it brings back shades of the holder's deceased loved ones as long as the stone is held. These shades are more physically solid than a ghost, but less so than a living body. Aside from this power, when the Resurrection Stone is owned in conjunction with the other two Hallows, it makes the owner the Master of Death."}}, {"pk": 9, "model": "marauder.artifact", "fields": {"kind": "restricted", "image": "images/time-turner.gif", "shop": null, "name": "Time-Turner", "owners": [15], "description": "<p>The Time-Turner was a device capable of time travel that resembled an hourglass on a necklace. The number of times one turns the hourglass corresponds to the number of hours one travels back in time.</p>\r\n\r\n<p>Time-related magic is unstable, and serious breaches in the laws of time result in catastrophic events. Possible scenarios include a wizard or witch killing their past or future selves by mistake, or altering one's life path in such a drastic fashion that it can result in temporal anomalies such as un-births. As such, the Ministry of Magic seeks the strictest guarantees if it permits the use of Time-Turners: Time-Turner possession is hedged around with literally hundreds of laws, and the most stringent laws and penalties are in place to prevent their misuse.</p>\r\n\r\n<p>The longest period that can be travelled back in time without serious chance of harm to the traveller or time itself is around five hours.</p>"}}, {"pk": 10, "model": "marauder.artifact", "fields": {"kind": "dark", "image": "images/handofglory.gif", "shop": 5, "name": "Hand Of Glory", "owners": [13], "description": "<p>The Hand of Glory is a dark artifact, a shriveled hand which gives light only to the holder.</p>\r\n\r\n<p>The Hand of Glory is a magical instrument which appears often in mystic lore. In general, it is described as a severed and preserved human hand, (maybe made of wax) with a candle implanted on it. The various powers ascribed to a Hand Of Glory include the ability to immobilise anyone who looks at it, or unlock any door it comes across. It was traditionally used by thieves, since it allowed them to see in otherwise total darkness, open locked doors, and immobilise guards. In some dark magical ceremonies, Hands of Glory were reputed to have been used as the source of illumination.</p>\r\n\r\n<p>Various grisly myths surround the making of a Hand of Glory (which fits well with the reputation of Borgin and Burkes). The hand is said to be that of an executed criminal (usually by hanging); most often the criminal himself is a murderer or other serious felon. Other myths say that a hanged man's blood is necessary to the recipe, or that his body fat is used to make the candle.</p>"}}, {"pk": 11, "model": "marauder.artifact", "fields": {"kind": "cursed", "image": "images/horcrux.gif", "shop": null, "name": "Horcrux", "owners": [24], "description": "<p>A Horcrux is a powerful object in which a Dark wizard or witch has hidden a fragment of his or her soul for the purpose of attaining immortality. Creating one Horcrux gives one the ability to anchor one's own soul to earth if the body is destroyed; the more horcruxes one creates, the closer one is to true immortality. Creating multiple Horcruxes is suggested to be costly to the creator, by both diminishing their humanity and even physically disfiguring them.</p>"}}, {"pk": 12, "model": "marauder.artifact", "fields": {"kind": "unique", "image": "images/2the-goblet-of-fire_1.gif", "shop": null, "name": "Goblet of Fire", "owners": [], "description": "The Goblet of Fire is the \"impartial judge\" for the Triwizard Tournament who chooses which students will represent their respective schools. After the students have finished placing their name in Goblet, the Goblet then chooses one student from each school by spitting out their name in a rush of red flames. Once chosen, the participants are subject to a binding magical contract in which they can not back out of the tournament. "}}, {"pk": 1, "model": "marauder.book", "fields": {"published_date": null, "image": "images/deathly-hallows.png", "name": "The Tales of Beedle The Bard", "subjects": [21, 22, 23], "author": 20, "publisher": "", "description": "<p>The Tales of Beedle the Bard is a collection of stories written for young wizards and witches, published by Chelf Press. They were popular bedtime stories for centuries, with the result that The Wizard and the Hopping Pot and The Fountain of Fair Fortune were as familiar to many of the students at Hogwarts as Cinderella and Sleeping Beauty are to various Muggle children.</p>"}}, {"pk": 2, "model": "marauder.book", "fields": {"published_date": null, "image": "images/250px-WinograndsWondrousWaterPlants.jpg", "name": "Magical Water Plants of the Mediterranean", "subjects": [], "author": 52, "publisher": "", "description": "In 1994, Barty Crouch Jr., disguised as Alastor Moody, gave a copy of this book to Neville Longbottom. As part of Crouch Jr.'s plan to manipulate the Triwizard Tournament to allow Harry Potter to win, he placed the book within Harry's reach as it contained information on Gillyweed, which would allow him to pass the Second Task. However, due to Harry's pride (not asking for help from everyone around him), he did not discover this book."}}, {"pk": 3, "model": "marauder.book", "fields": {"published_date": null, "image": "images/Pottedmandrake.png", "name": "Flesh-Eating Trees of the World", "subjects": [], "author": 53, "publisher": "", "description": "Flesh-Eating Trees of the World was a book used by Hogwarts School of Witchcraft and Wizardry as a sixth year Herbology text. Among other subjects, it covered the correct way to juice a Snargaluff pod and self-fertilising shrubs."}}, {"pk": 4, "model": "marauder.book", "fields": {"published_date": null, "image": "images/A_history_of_magic-pottermore.png", "name": "A History of Magic", "subjects": [], "author": 46, "publisher": "", "description": "It was a required text for all Hogwarts students from the first year onward for the History of Magic class taught by Professor Binns. Hermione Granger had an extra copy of this book in her school trunk. A copy of this book costs 2 Galleons at Flourish and Blotts."}}, {"pk": 5, "model": "marauder.book", "fields": {"published_date": null, "image": "images/250px-Magical_Me.jpg", "name": "Magical Me", "subjects": [], "author": 47, "publisher": "", "description": "Magical Me is the autobiography of Gilderoy Lockhart, part of his collected works. It includes much of his (later proven false) achievements."}}, {"pk": 6, "model": "marauder.book", "fields": {"published_date": null, "image": "images/The_Toadstool_Tales.jpg", "name": "The Toadstool Tales", "subjects": [], "author": 54, "publisher": "", "description": "The Toadstool Tales were a series of adaptations of other works, written by Beatrix Bloxam. They contained soppy, 'sanitized' versions of other works, including the The Tales of Beedle the Bard , which was Mrs. Bloxam's way of purifying them so as to preserve childrens' innocence. Beatrix Bloxam set out to write The Toadstool Tales because of the \"unwholesome characters\" and themes found in The Tales of Beedle the Bard that she believed were damaging to children."}}, {"pk": 7, "model": "marauder.book", "fields": {"published_date": "1997-01-01", "image": "images/lifeandlies.jpg", "name": "The Life and Lies of Albus Dumbledore", "subjects": [4, 6, 7, 17], "author": 9, "publisher": "The Daily Prophet Press", "description": "Published in 1997 in the wake of Albus Dumbledore's death, this book brought the gritty secrets and rumors of Albus' past to public attention. The Daily Prophet rated The Life and Lies of Albus Dumbledore 5 stars and interviewed Rita Skeeter for a promotional article.\r\n\r\nIn this book, Skeeter covers how the Dumbledore family hid away Ariana Dumbledore's mental instability caused by a traumatatic assault. It goes on about how their father, Percival Dumbledore, was sent to Azkaban for seeking revenge against Ariana's attackers. It probes questions into Albus' friendship with Gellert Grindelwald who later becomes one of the world's powerful dark wizards, finally defeated by Albus in 1945. While still living in Godric's Hollow, Ariana was killed by getting in the way of a duel between her brothers and Grindelwald, and it is uncertain who dealt the killing blow. Rita also speculates that Harry Potter was involved with Albus' murder.\r\n\r\nFortunately for Rita Skeeter, the dead cannot be libelled"}}, {"pk": 8, "model": "marauder.book", "fields": {"published_date": null, "image": "images/Hogwarts-a-history-pottermore.png", "name": "Hogwarts, A History", "subjects": [], "author": 46, "publisher": "", "description": "Hogwarts: A History, also known as Hogwarts, A History, is a book concerning Hogwarts School of Witchcraft and Wizardry and its history that was written by Bathilda Bagshot. It was Hermione Granger's favorite book and she often referred to this book on many things concerning Hogwarts School of Witchcraft and Wizardry. Three of the things that are frequently brought up are the Great Hall's enchanted ceiling that shows the weather outside, the fact that you cannot apparate or disapparate on Hogwarts grounds and the fact that electronic devices do not work within the grounds.\r\n\r\nThe book was also very popular in Harry Potter's second year at Hogwarts, when every copy was checked out of the library due to the reopening of the Chamber of Secrets. This caused Hermione great frustration, as despite her fondness for the book, she had left it behind that year due to lack of space because of the many texts assigned by Gilderoy Lockhart. However, Hermione shows slight frustration with the book when scathingly renaming the book in her fourth year because it does not mention the use of house-elves at Hogwarts, even going so far as to suggest a couple of alternative titles for it: A Revised History of Hogwarts and A Highly Biased and Selective History of Hogwarts Which Glosses Over the Nastier Aspects of the School."}}, {"pk": 9, "model": "marauder.book", "fields": {"published_date": null, "image": "images/Severus-Snape-severus-snape-37306854-120-89.jpg", "name": "Snape: Scoundrel or Saint?", "subjects": [], "author": 9, "publisher": "", "description": "Snape: Scoundrel or Saint? was a biography of Severus Snape written by Rita Skeeter. It was written sometime after Snape's death and given the speed with which Skeeter turned out one of her other sensational biographies, such as The Life and Lies of Albus Dumbledore, may have been published as early as June 1998. Skeeter apparently penned the book despite public efforts by Harry Potter to bring to light Snape's key role in opposing Lord Voldemort. In keeping with her previous books it is likely to have been another hatchet job, and probably focused much more on depicting him as a scoundrel rather than as a saint."}}, {"pk": 10, "model": "marauder.book", "fields": {"published_date": null, "image": "images/250px-Advanced_Potion-Making.jpg", "name": "Advanced Potion-Making", "subjects": [], "author": 55, "publisher": "", "description": "Advanced Potion-Making is a book written by Libatius Borage. As the title implies this book contains advanced recipes and verious other topics related to potion-making."}}, {"pk": 1, "model": "marauder.story", "fields": {"quote_by": "Xenophilius Lovegood", "kind": "legend", "quote": "That is a children's tale, told to amuse rather than to instruct. Those of us who understand these matters, however, recognise that the ancient story refers to three objects, or Hallows, which, if united, will make the possessor Master of Death.", "image": "images/deathly-hallows_1.png", "artifacts": [2, 3, 8], "locations": [7], "date": "1500-01-01", "name": "Deathly Hallows", "book": 1, "characters": [6, 7, 17, 21, 22, 23, 24, 25], "description": "<p>The Deathly Hallows are three powerful magical objects created by Death given to three brothers, Antioch Peverell, Cadmus Peverell, and Ignotus Peverell. Many years ago, the Peverell brothers were travelling at twilight and reached an uncrossable river. Since they were wizards, they simply created a bridge to cross. Death stopped them, congragulating them on escaping him, and offered each an object of their choosing. Antioch received the Elder Wand, the most powerful wand of all time. Cadmus received the Resurrection Stone, a stone which could bring the dead back to life. Finally, Ignotus received the Cloak of Invisibility, as he did not trust Death and wanted to continue escaping him.</p>\r\n\r\n<p>After each went their separate ways, Antioch bragged about the power of the Elder Wand and was murdered in his sleep by another who wanted to possess it. Cadmus used the Resurrection Stone to bring back his dead lover, but what came back was not truly her. He committed suicide from grief. Ignotus used the cloak and finally greeted Death willingly as an old man.</p>\r\n\r\n<p>According to this legend, the person who holds all three of these items becomes the Master of Death. Only Harry Potter has had all three at once. Harry received the Invisibility Cloak from his father, James Potter, and it is believed that Ignotus Peverell is a paternal ancestor to him. Albus Dumbledore had the Elder Wand, but lost it to Draco Malfoy who disarmed him. Harry Potter eventually took this from Malfoy. Finally, Dumbledore left the Resurrection Stone to Harry in the golden snitch left to him in Dumbledore's will.</p>"}}, {"pk": 2, "model": "marauder.story", "fields": {"quote_by": "Xenophilius Lovegood", "kind": "history", "quote": "That is a children's tale, told to amuse rather than to instruct. Those of us who understand these matters, however, recognise that the ancient story refers to three objects, or Hallows, which, if united, will make the possessor Master of Death.", "image": "images/the-boy-who-lived.jpg", "artifacts": [], "locations": [7], "date": "1980-10-31", "name": "The Boy Who Lived", "book": null, "characters": [7, 24, 25, 26], "description": "<p>Harry Potter was born on July 31st, 1980, to Lily and James Potter. His parents were members of the Order of the Phoenix, an organization dedicated to bringing about the ruin of Lord Voldemort. From birth, he lived in hiding with his parents after Voldemort marked him, and Neville Longbottom, for death. Neville was born just a few hours before Harry Potter. Voldemort feared the boys because of The Prophecy.</p>\r\n\r\n<p>His parents were going to make Sirius Black their Secret-Keeper, the only security loophole through the Fidelius Charm keeping them hidden in Godric's Hollow. However, they changed their secret keeper to Peter Pettigrew instead, whom they thought would be less suspicious. Unfortunately, Pettigrew was already a spy for Voldemort and he betrayed the Potters, faked his death, and framed Sirius for both as no one else knew who the true Secret-Keeper was.</p>\r\n\r\n<p>Halloween 1981, Voldemort came to Godric's Hollow to murder the Potter family. He killed James immediately, and then killed Lily, who died protecting her son Harry. This sacrifice gave Harry an ancient magical protection based on love, and Voldemort's killing curse backfired on him. Voldemort lost all his powers, his physical form was destroyed, and Harry was left with a cursed lightning-shaped scar which formed a connection between him and his parents' killer. Everyone believed Voldemort was dead, but he would slowly crawl back from the unknown thanks to his maniacal use of horcruxes.</p>\r\n\r\n<p>Thus ended the reign of terror of Lord Voldemort, leaving Harry Potter as an orphan and the only person to have ever survived the killing curse. At just one year of age, Harry Potter became one of the most famous wizards to ever live.</p>"}}, {"pk": 3, "model": "marauder.story", "fields": {"quote_by": "Albus Dumbledore", "kind": "law", "quote": "As the witch-hunts grew ever fiercer, wizarding families began to live double lives, using charms of concealment to protect themselves and their families. By the seventeenth century, any witch or wizard who chose to fraternise with Muggles became suspect, even an outcast in his or her own community.", "image": "images/ministry-of-magic_1.png", "artifacts": [], "locations": [8], "date": "1692-01-01", "name": "International Statute of Wizarding Secrecy", "book": null, "characters": [1, 4, 27], "description": "<p>The International Statute of Wizarding Secrecy is a law in the wizarding rule first signed in 1689, then officially established in 1692. This law protects the wizarding community from Muggles, hiding their existence from their world.</p>\r\n\r\n<p>In the 17th century, wizard-Muggle relations were at their worst. Ever since the 15th century, witches and wizards were being persecuted all over Europe. They were locked up and sentenced to death on the charge of witchcraft. While some managed to escape like Wendelin the Weird, others like Sir Nicholas de Mimsy-Porpington were not so lucky. Children were especially vulnerable, as they were unable to control their own magic, making them noticeable and powerless against their attackers. Muggles were also mistakenly identified as magical, and they had no magic to protect them from being burned at the stake.</p>\r\n\r\n<p>The Ministry of Magic, recently created, attempted to deal with the muggle British Monarch, begging for protection under muggle law. This did not happen, which seems to be the final straw that forced the wizarding world into secrecy.</p>\r\n\r\n<p>The Statute states that each Ministry of Magic administration is responsible for hiding the presence of the magical community within their own countries. Among other things, they must control magical beasts, public displays of underage magic, and ensure that magical games and sports are played without risk of discovery. Wizards and witches are required to blend in with the muggle community when about, such as wearing appropriate dress code around muggles.</p>"}}, {"pk": 4, "model": "marauder.story", "fields": {"quote_by": "J.K. Rowling", "kind": "legend", "quote": "He was standing at the end of a long, dimly lit chamber. Towering stone pillars entwined with more serpents, rose to a ceiling lost in darkness, casting long, black shadows through the odd, greenish gloom that filled the place.", "image": "images/chamber-of-secrets.gif", "artifacts": [], "locations": [1], "date": "1100-01-01", "name": "The Chamber of Secrets", "book": null, "characters": [2, 7, 10, 12, 15, 16, 24, 28], "description": "<p>In the Middle Ages, when Hogwarts was first formed, Salazar Slytherin had a dispute with the other founders about whom to admit into the school. Slytherin wanted only pure-blood students, but the others did not share his prejudice. Slytherin left the school, but not before creating the Chamber of Secrets somewhere under the dungeon of Hogwarts.</p>\r\n\r\n<p>The Chamber of Secrets was home to an ancient basilisk, which was intended to purge the school of Muggle-born students. Only Slytherin's heir could gain entrance by using Parseltongue, an ability only heirs of Slytherin possessed. For centuries headmasters tried to find the Chamber, to no avail. Many dismissed the Chamber as a mere legend.</p>\r\n\r\n<p>Twice it has been opened, by Tom Marvolo Riddle in 1943 and by Ginny Weasley, possessed by Riddle's horcrux diary, in 1992. The first time, Riddle's last victim, Moaning Myrtle, was killed. Riddle placed the blame on Rubeus Hagrid, whom he caught nursing a pet acromantula named Aragog. Everyone assumed this to be the monster that was terrorizing the school. Hagrid was expelled and Riddle received a trophy of Special Services to the School. However, Albus Dumbledore, then a Transfiguration professor, distrusted Riddle from here on out and kept a close eye on him.</p>\r\n\r\n<p>Since the case seemed to be closed, it was no longer safe for Riddle to open the Chamber. He created a diary, preserving his sixteen-year-old self, hoping one day to lead someone else into the Chamber of Secrets to continue his work. This happened when Ginny Weasley found the diary, planted in her belongings by Lucius Malfoy.</p>\r\n\r\n<p>Luckily, no one died this time around. Ginny Weasley was close to death, fading away in the Chamber of Secrets, when Harry Potter, Ron Weasley, and Hermione Granger came to her rescue. Harry Potter, who can use Parseltongue thanks to the connection he has with Voldemort through his cursed scar, defeated the Basilisk with Godric Gryffindor's sword, and destroyed Tom Riddle's diary.</p>"}}, {"pk": 5, "model": "marauder.story", "fields": {"quote_by": "Albus Dumbledore", "kind": "sport", "quote": "Eternal glory! That's what awaits the student who wins The Triwizard Tournament, but to do this, that student must survive three tasks. Three extremely dangerous tasks.", "image": "images/the-goblet-of-fire_1.gif", "artifacts": [], "locations": [], "date": "1294-01-01", "name": "The Triwizard Tournament", "book": null, "characters": [7, 24, 29, 30, 31, 32], "description": "<p>The Triwizard Tournament is a magical contest held between the three largest wizarding schools of Europe: Hogwarts School of Witchcraft and Wizardry, Durmstrang Institute, and Beauxbatons Academy of Magic, each school being represented by one Champion. Selected Champions compete in three tasks - traditionally judged by the Headmasters or Headmistresses of the competing schools - designed to test magical ability, intelligence and courage. Champions compete for the honour and glory of winning the Tournament and for the Triwizard Cup and a monetary prize. The first Tournament was held in 1294. The Tournament has been renowned for being extremely dangerous: champions have died while competing, and so it was discontinued after 1792.</p>\r\n\r\n<p>The Triwizard Tournament was established as a friendly competition between the wizarding schools the Hogwarts School of Witchcraft and Wizardry, the Beauxbatons Academy of Magic, and the Durmstrang Institute. Held every five years, the competition would be hosted by each school in turn, the judges for the Tournament comprising the headmasters or headmistresses of the schools. Each competing school is allowed one Champion to represent them during the Tournament. Students wishing to participate write their names and the school they attend on a piece of parchment, and enter it into the Goblet of Fire. The Goblet is an impartial judge, and selects what it considers to be the best student from each school. At the appointed time, the Goblet ejects the names, making each selected student the official Champion for their school. Each selected Champion is then bound by a magical contract to see the Tournament through to the end. The Yule Ball, held on Christmas Day night, is a traditional part of the Tournament. The Ball usually includes a feast, and a formal dance where the Champions and their partners lead the host school in dancing. Students old enough to attend are allowed to bring a friend. Students that are too young to attend may attend if invited by a student old enough to attend the ball.</p>\r\n\r\n<p>A revival of the Tournament occurred in 1994. Barty Crouch Sr., Head of the Ministry of Magic's Department of International Magical Cooperation, in conjunction with Ludo Bagman, Head of the Department of Magical Games and Sports, worked with their opposite numbers in other countries to revive the Tournament. However, due to the dangerous nature of the Tournament, it was decided that some changes were to be made to the rules, with the main one being that no student under the age of seventeen was allowed to enter or compete (some students did try to).</p>\r\n\r\n<p>Despite the secrecy surrounding the Triwizard Tournament, Lord Voldemort found out about it from Bertha Jorkins, a Ministry employee in the Department of Magical Games and Sports who had been holidaying in Albania and had run into Peter Pettigrew at an inn. Armed with this information, Voldemort set a plan into motion. He freed Crouch Jr from the Imperius Curse, and ordered him to disguise himself as Alastor Moody, Hogwarts' new Defence Against the Dark Arts teacher. There, he would manipulate the Tournament as his Master commanded to achieve the Dark Lord's goal: the destruction of Harry Potter.</p>\r\n\r\n<p>During the third task, Harry Potter and Cedric Diggory, the Hogwarts champion chosen fairly by the Goblet of Fire, were transported via portkey to a graveyard in Little Hangleton to meet Voldemort. Voldemort only intended Harry Potter to make it there, so Cedric Diggory was swiftly killed. Harry managed to escape, but Voldemort was reborn.</p>"}}, {"pk": 6, "model": "marauder.story", "fields": {"quote_by": "Sybill Trelawney", "kind": "history", "quote": "The one with the power to vanquish the Dark Lord approaches ... born to those who have thrice defied him, born as the seventh month dies ... and the Dark Lord will mark him as his equal, but he will have power the Dark Lord knows not ... and either must die at the hand of the other for neither can live while the other survives ... the one with the power to vanquish the Dark Lord will be born as the seventh month dies …", "image": "images/prophecy.jpg", "artifacts": [], "locations": [9], "date": "1980-01-01", "name": "The Prophecy", "book": null, "characters": [6, 7, 14, 24, 33, 34], "description": "<p>Sybill Trelawney spoke a prophecy to Albus Dumbledore at the Hog's Head Pub in 1980. The prophecy was made during an interview for the spot of Diviniation professor at Hogwarts School of Witchcraft and Wizardry. Dumbledore, who was disappointed at the performance she gave during the interview, was about to leave when she went into a trance and made the prophecy. It referred to a boy born at the end of July, who has the power to defeat Lord Voldemort. Severus Snape was eavesdropping on their conversation is who relayed the prophecy to Voldemort. Voldemort chose to go after Harry Potter as he was half-blood, but Neville Longbottom, a pure-blood, also fit the criteria of the prophecy.</p>\r\n\r\n<p>Shocked by Voldemort's decision, Snape hastened to Dumbledore and explained that Voldemort had come to the conclusion that the Potters' child was his would-be vanquisher, and had vowed to kill him. Snape also confessed his longtime love for Harry's mother, Lily, and offered Dumbledore his loyalty in exchange for her protection. Snape was now loyal to two masters, who were enemies.</p>"}}, {"pk": 7, "model": "marauder.story", "fields": {"quote_by": "Oliver Wood", "kind": "sport", "quote": "Bad news, Harry. I've just been to see Professor McGonagall about the Firebolt. She – er, got a bit shirty with me. Told me I'd got my priorities wrong. Seemed to think I cared more about winning the Cup than I do about staying alive. Just because I told her I didn't care if it threw you off, as long as you caught the Snitch first.", "image": "images/quidditch.gif", "artifacts": [], "locations": [1], "date": "1050-01-01", "name": "Quidditch", "book": null, "characters": [7, 13, 16, 25, 29, 31], "description": "<p>Quidditch is a wizarding sport played on broomsticks. It is the most popular game among wizards and witches. The object of the game is to score more points than your opponents. Each goal is worth ten points and catching the Snitch is worth one-hundred fifty points. The game ends when the Snitch is caught or an agreement is reached between the captains of both teams. Some games can go on for many days if the Snitch is not caught (the record, according to Quidditch Through the Ages, is three months).</p>\r\n\r\n<p>The game is played by two teams of seven people (three Chasers, two Beaters, one Keeper, and one Seeker) and involves four balls (a Quaffle, two Bludgers, and a Golden Snitch).</p>\r\n\r\n<p>The Keeper guards the goal posts, while the three Chasers score goals with the Quaffle by tossing it into one of the opposing team's three goal posts. The two Beaters keep the Bludgers away from their team and hit the Bludgers towards the opposing team, and the Seeker catches the Golden Snitch to end the game. The team whose Seeker catches the Snitch is awarded 150 points, but this does not necessarily mean they will win if the other team still has more points after the Snitch is caught.</p>"}}, {"pk": 8, "model": "marauder.story", "fields": {"quote_by": "Hermione Granger", "kind": "organization", "quote": "It's a secret society. Dumbledore's in charge, he founded it. It's the people who fought against You-Know-Who last time.", "image": "images/order-of-the-phoenix.jpg", "artifacts": [], "locations": [10, 11], "date": "1970-01-01", "name": "Order of the Phoenix", "book": null, "characters": [6, 10, 14, 25, 26, 35, 36, 37, 38, 39, 40, 41, 42, 43], "description": "<p>The Order of the Phoenix was a secret society founded by Albus Dumbledore to oppose Lord Voldemort and his Death Eaters. The original Order was created sometime in 1970s, after Voldemort returned to England from abroad and started his campaign to take over the Ministry of Magic and persecute Muggle-borns. The Order worked with the Ministry to oppose the Dark Lord and his followers, and played a crucial role in the First Wizarding War. Victory came in 1981 at the cost of many of their members.</p>\r\n\r\n<p>The Order disbanded, but was reconvened in 1995 after Harry Potter informed Dumbledore of Lord Voldemort's return. The Ministry refused to admit that the Dark Lord had returned, thus the Order alone worked to protect Harry Potter and the prophecy concerning him and Voldemort in the Department of Mysteries. After a battle occurred there in 1996 between the Order and the Death Eaters, the Ministry admitted the truth. However, the next year would see the Order losing their leader and the Ministry being conquered by Voldemort. The Order remained an underground resistance, trying to protect Muggles and broadcast the truth during the worst days of the Second Wizarding War. They answered the call to arms by Dumbledore's Army on 2 May, 1998, fighting Voldemort and his Death Eaters for the final time at Hogwarts School of Witchcraft and Wizardry. The Battle of Hogwarts ended with Voldemort's death and a decisive victory for the Order and their allies.</p>"}}, {"pk": 9, "model": "marauder.story", "fields": {"quote_by": "Sirius Black", "kind": "history", "quote": "...Accepting Voldemort's back would mean trouble like the Ministry hasn't had to cope with for nearly fourteen years. Fudge just can't bring himself to face it. It's so much more comfortable to convince himself Dumbledore's lying and trying to destabilize him.", "image": "images/campaign-to-discredit.jpg", "artifacts": [], "locations": [8], "date": "1995-01-01", "name": "Campaign to Discredit Albus Dumbledore and Harry Potter", "book": null, "characters": [6, 7, 9, 44], "description": "<p>This campaign encapsulates the Ministry of Magic's attempts to discredit, slander, and smear both Albus Dumbledore and Harry Potter, as well as anyone perceived or believed to be an ally with them. It was put in place on June 24th, 1995 — after the Rebirth of Lord Voldemort and ended on June 18th, 1996 — after the Battle of the Department of Mysteries. This campaign was put into place when Minister for Magic Cornelius Fudge denied the Dark Lord's return, a fact that would ruin the thirteen years of peace that the Ministry had worked so hard to build and maintain. Instead, due to paranoia, he believed that Dumbledore was trying to usurp his position of Minister for Magic, and not only used the Daily Prophet to make it look as though Dumbledore and Potter were liars and \"\"nutters,\"\" but also stripped Dumbledore of many of his titles and statuses: Supreme Mugwump of the International Confederation of Wizards, the Chief Warlock of the Wizengamot, the Order of Merlin, and eventually the Headmastership of Hogwarts School of Witchcraft and Wizardry.</p>\r\n\r\n<p>Harry, for supporting Dumbledore and being the one who claimed Voldemort returned, also suffered from this campaign. Fudge planted Dolores Umbridge as the Hogwarts High Inquisitor and headmistress in order to further destabilise Dumbledore and Harry. Fudge also made it clear that anyone siding with Dumbledore should clear out their desks in the Ministry's office. Due to the great influence the Ministry had, the majority of the wizarding community ceased supporting Dumbledore and Harry and lost a chance to prepare themselves against Voldemort. The campaign also pressed the position that Harry was a deluded attention-seeker that could not be trusted.</p>\r\n\r\n<p>When Voldemort was revealed to have truly returned, Fudge was forced to accept it and to reveal everything to the world, by which time it was too late to prepare. The campaign, along with all the Educational Decrees and Daily Prophet articles that were crafted to fuel it, were all retracted, and Fudge was subsequently dismissed in disgrace.</p>"}}, {"pk": 10, "model": "marauder.story", "fields": {"quote_by": "Neville Longbottom", "kind": "organization", "quote": "We're his army. Dumbledore's Army... Everyone in this room's been fighting... Everyone in here's proven they're loyal to Dumbledore — loyal to you [Harry Potter].", "image": "images/dumbledores-army.gif", "artifacts": [], "locations": [12], "date": "1995-01-01", "name": "Dumbledore's Army", "book": null, "characters": [7, 15, 16, 28, 34, 45], "description": "<p>Dumbledore's Army, also known as the D.A. or Defence Association, was a secret organisation initiated by Harry Potter, Hermione Granger, and Ron Weasley to teach their fellow Hogwarts students proper Defence Against the Dark Arts in 1995. This organisation was made necessary by the refusal of Dolores Umbridge, the subject's professor during the 1995-1996 school year, to teach anything in her classes other than textbook theory. It had approximately 28 members. The group was disbanded during the 1996-1997 school year following the appointment of Severus Snape as Defence Against the Dark Arts teacher, although several members heeded the call and participated in the Battle of the Astronomy Tower at the end of the year.</p>\r\n\r\n<p>It was restarted by Neville Longbottom, Ginny Weasley, and Luna Lovegood during the 1997-1998 school year after Hogwarts fell under the control of Lord Voldemort in order to oppose Death Eater professors Alecto and Amycus Carrow, who spread propaganda against Muggles and Muggle-borns and taught the Dark Arts. Dumbledore's Army played a vital role during the Second Wizarding War, and members of the organisation fought in the Battle of the Department of Mysteries, the Battle of the Astronomy Tower, and the Battle of Hogwarts.</p>"}}, {"pk": 1, "model": "marauder.relationship", "fields": {"character1": 4, "descriptor1": "Sister", "descriptor2": "Brother", "character2": 6}}, {"pk": 2, "model": "marauder.relationship", "fields": {"character1": 4, "descriptor1": "Sister", "descriptor2": "Brother", "character2": 35}}, {"pk": 3, "model": "marauder.relationship", "fields": {"character1": 6, "descriptor1": "Brother", "descriptor2": "Brother", "character2": 35}}, {"pk": 4, "model": "marauder.relationship", "fields": {"character1": 7, "descriptor1": "Son", "descriptor2": "Father", "character2": 25}}, {"pk": 5, "model": "marauder.relationship", "fields": {"character1": 7, "descriptor1": "Son", "descriptor2": "Mother", "character2": 26}}, {"pk": 6, "model": "marauder.relationship", "fields": {"character1": 7, "descriptor1": "Husband", "descriptor2": "Wife", "character2": 28}}, {"pk": 7, "model": "marauder.relationship", "fields": {"character1": 7, "descriptor1": "Godson", "descriptor2": "Godfather", "character2": 42}}, {"pk": 8, "model": "marauder.relationship", "fields": {"character1": 7, "descriptor1": "Descendant", "descriptor2": "Paternal ancestor", "character2": 22}}, {"pk": 9, "model": "marauder.relationship", "fields": {"character1": 12, "descriptor1": "Ancestor", "descriptor2": "Descendant", "character2": 24}}, {"pk": 10, "model": "marauder.relationship", "fields": {"character1": 23, "descriptor1": "Ancestor", "descriptor2": "Descendant", "character2": 24}}, {"pk": 11, "model": "marauder.relationship", "fields": {"character1": 15, "descriptor1": "Wife", "descriptor2": "Husband", "character2": 16}}, {"pk": 12, "model": "marauder.relationship", "fields": {"character1": 25, "descriptor1": "Husband", "descriptor2": "Wife", "character2": 26}}, {"pk": 13, "model": "marauder.relationship", "fields": {"character1": 28, "descriptor1": "Sister", "descriptor2": "Brother", "character2": 16}}, {"pk": 14, "model": "marauder.relationship", "fields": {"character1": 16, "descriptor1": "Son", "descriptor2": "Father", "character2": 40}}, {"pk": 15, "model": "marauder.relationship", "fields": {"character1": 16, "descriptor1": "Son", "descriptor2": "Mother", "character2": 41}}, {"pk": 16, "model": "marauder.relationship", "fields": {"character1": 21, "descriptor1": "Brother", "descriptor2": "Brother", "character2": 22}}, {"pk": 17, "model": "marauder.relationship", "fields": {"character1": 21, "descriptor1": "Brother", "descriptor2": "Brother", "character2": 23}}, {"pk": 18, "model": "marauder.relationship", "fields": {"character1": 22, "descriptor1": "Brother", "descriptor2": "Brother", "character2": 23}}, {"pk": 19, "model": "marauder.relationship", "fields": {"character1": 34, "descriptor1": "Son", "descriptor2": "Father", "character2": 39}}, {"pk": 20, "model": "marauder.relationship", "fields": {"character1": 34, "descriptor1": "Son", "descriptor2": "Mother", "character2": 38}}, {"pk": 21, "model": "marauder.relationship", "fields": {"character1": 48, "descriptor1": "Daughter", "descriptor2": "Mother", "character2": 49}}, {"pk": 22, "model": "marauder.relationship", "fields": {"character1": 8, "descriptor1": "Son", "descriptor2": "Mother", "character2": 50}}, {"pk": 23, "model": "marauder.relationship", "fields": {"character1": 8, "descriptor1": "Son", "descriptor2": "Father", "character2": 51}}, {"pk": 24, "model": "marauder.relationship", "fields": {"character1": 59, "descriptor1": "Brother", "descriptor2": "Brother", "character2": 16}}, {"pk": 25, "model": "marauder.relationship", "fields": {"character1": 58, "descriptor1": "Twin Brother", "descriptor2": "Twin Brother", "character2": 59}}, {"pk": 26, "model": "marauder.relationship", "fields": {"character1": 58, "descriptor1": "Brother", "descriptor2": "Brother", "character2": 16}}]